ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
esp32wrover.menu.EraseFlash.none=Disabled
esp32wrover.menu.EraseFlash.none.upload.erase_cmd=
esp32wrover.menu.EraseFlash.all=Enabled
esp32wrover.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

pico32.name=ESP32 PICO-D4

pico32.bootloader.tool=esptool_py
pico32.bootloader.tool.default=esptool_py

pico32.upload.tool=esptool_py
pico32.upload.tool.default=esptool_py
pico32.upload.tool.network=esp_ota

pico32.upload.maximum_size=1310720
pico32.upload.maximum_data_size=327680
pico32.upload.flags=
pico32.upload.extra_flags=

pico32.serial.disableDTR=true
pico32.serial.disableRTS=true

pico32.build.tarch=xtensa
pico32.build.bootloader_addr=0x1000
pico32.build.target=esp32
pico32.build.mcu=esp32
pico32.build.core=esp32
pico32.build.variant=pico32
pico32.build.board=ESP32_PICO

pico32.build.f_cpu=240000000L
pico32.build.flash_size=4MB
pico32.build.flash_freq=80m
pico32.build.flash_mode=dio
pico32.build.boot=dio
pico32.build.partitions=default
pico32.build.defines=

pico32.menu.PartitionScheme.default=Default
pico32.menu.PartitionScheme.default.build.partitions=default
pico32.menu.PartitionScheme.no_ota=No OTA (Large APP)
pico32.menu.PartitionScheme.no_ota.build.partitions=no_ota
pico32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
pico32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
pico32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
pico32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

pico32.menu.UploadSpeed.921600=921600
pico32.menu.UploadSpeed.921600.upload.speed=921600
pico32.menu.UploadSpeed.115200=115200
pico32.menu.UploadSpeed.115200.upload.speed=115200
pico32.menu.UploadSpeed.256000.windows=256000
pico32.menu.UploadSpeed.256000.upload.speed=256000
pico32.menu.UploadSpeed.230400.windows.upload.speed=256000
pico32.menu.UploadSpeed.230400=230400
pico32.menu.UploadSpeed.230400.upload.speed=230400
pico32.menu.UploadSpeed.460800.linux=460800
pico32.menu.UploadSpeed.460800.macosx=460800
pico32.menu.UploadSpeed.460800.upload.speed=460800
pico32.menu.UploadSpeed.512000.windows=512000
pico32.menu.UploadSpeed.512000.upload.speed=512000

pico32.menu.DebugLevel.none=None
pico32.menu.DebugLevel.none.build.code_debug=0
pico32.menu.DebugLevel.error=Error
pico32.menu.DebugLevel.error.build.code_debug=1
pico32.menu.DebugLevel.warn=Warn
pico32.menu.DebugLevel.warn.build.code_debug=2
pico32.menu.DebugLevel.info=Info
pico32.menu.DebugLevel.info.build.code_debug=3
pico32.menu.DebugLevel.debug=Debug
pico32.menu.DebugLevel.debug.build.code_debug=4
pico32.menu.DebugLevel.verbose=Verbose
pico32.menu.DebugLevel.verbose.build.code_debug=5

pico32.menu.EraseFlash.none=Disabled
pico32.menu.EraseFlash.none.upload.erase_cmd=
pico32.menu.EraseFlash.all=Enabled
pico32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32s3box.name=ESP32-S3-Box
esp32s3box.vid.0=0x303a
esp32s3box.pid.0=0x1001

esp32s3box.bootloader.tool=esptool_py
esp32s3box.bootloader.tool.default=esptool_py

esp32s3box.upload.tool=esptool_py
esp32s3box.upload.tool.default=esptool_py
esp32s3box.upload.tool.network=esp_ota

esp32s3box.upload.maximum_size=1310720
esp32s3box.upload.maximum_data_size=327680
esp32s3box.upload.speed=921600
esp32s3box.upload.flags=
esp32s3box.upload.extra_flags=
esp32s3box.upload.use_1200bps_touch=false
esp32s3box.upload.wait_for_upload_port=false

esp32s3box.serial.disableDTR=false
esp32s3box.serial.disableRTS=false

esp32s3box.build.tarch=xtensa
esp32s3box.build.bootloader_addr=0x0
esp32s3box.build.target=esp32s3
esp32s3box.build.mcu=esp32s3
esp32s3box.build.core=esp32
esp32s3box.build.variant=esp32s3box
esp32s3box.build.board=ESP32_S3_BOX

esp32s3box.build.usb_mode=1
esp32s3box.build.cdc_on_boot=1
esp32s3box.build.msc_on_boot=0
esp32s3box.build.dfu_on_boot=0
esp32s3box.build.f_cpu=240000000L
esp32s3box.build.flash_size=16MB
esp32s3box.build.flash_freq=80m
esp32s3box.build.flash_mode=dio
esp32s3box.build.boot=qio
esp32s3box.build.partitions=default
esp32s3box.build.defines=-DBOARD_HAS_PSRAM
esp32s3box.build.memory_type=qio_opi
esp32s3box.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32s3box.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1

esp32s3box.menu.USBMode.hwcdc=Hardware CDC and JTAG
esp32s3box.menu.USBMode.hwcdc.build.usb_mode=1
esp32s3box.menu.USBMode.hwcdc.upload.use_1200bps_touch=false
esp32s3box.menu.USBMode.hwcdc.upload.wait_for_upload_port=false
esp32s3box.menu.USBMode.default=USB-OTG
esp32s3box.menu.USBMode.default.build.usb_mode=0
esp32s3box.menu.USBMode.default.upload.use_1200bps_touch=true
esp32s3box.menu.USBMode.default.upload.wait_for_upload_port=true

esp32s3box.menu.MSCOnBoot.default=Disabled
esp32s3box.menu.MSCOnBoot.default.build.msc_on_boot=0
esp32s3box.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
esp32s3box.menu.MSCOnBoot.msc.build.msc_on_boot=1

esp32s3box.menu.DFUOnBoot.default=Disabled
esp32s3box.menu.DFUOnBoot.default.build.dfu_on_boot=0
esp32s3box.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
esp32s3box.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

esp32s3box.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32s3box.menu.PartitionScheme.default.build.partitions=default
esp32s3box.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32s3box.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32s3box.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32s3box.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32s3box.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32s3box.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32s3box.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32s3box.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32s3box.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32s3box.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32s3box.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32s3box.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32s3box.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32s3box.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32s3box.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32s3box.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32s3box.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32s3box.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32s3box.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32s3box.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32s3box.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32s3box.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32s3box.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32s3box.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32s3box.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32s3box.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32s3box.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s3box.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32s3box.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32s3box.menu.PartitionScheme.rainmaker=RainMaker
esp32s3box.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32s3box.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

esp32s3box.menu.DebugLevel.none=None
esp32s3box.menu.DebugLevel.none.build.code_debug=0
esp32s3box.menu.DebugLevel.error=Error
esp32s3box.menu.DebugLevel.error.build.code_debug=1
esp32s3box.menu.DebugLevel.warn=Warn
esp32s3box.menu.DebugLevel.warn.build.code_debug=2
esp32s3box.menu.DebugLevel.info=Info
esp32s3box.menu.DebugLevel.info.build.code_debug=3
esp32s3box.menu.DebugLevel.debug=Debug
esp32s3box.menu.DebugLevel.debug.build.code_debug=4
esp32s3box.menu.DebugLevel.verbose=Verbose
esp32s3box.menu.DebugLevel.verbose.build.code_debug=5

