ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
esp32s3box.menu.EraseFlash.none=Disabled
esp32s3box.menu.EraseFlash.none.upload.erase_cmd=
esp32s3box.menu.EraseFlash.all=Enabled
esp32s3box.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32s3usbotg.name=ESP32-S3-USB-OTG
esp32s3usbotg.vid.0=0x303a
esp32s3usbotg.pid.0=0x1001

esp32s3usbotg.bootloader.tool=esptool_py
esp32s3usbotg.bootloader.tool.default=esptool_py

esp32s3usbotg.upload.tool=esptool_py
esp32s3usbotg.upload.tool.default=esptool_py
esp32s3usbotg.upload.tool.network=esp_ota

esp32s3usbotg.upload.maximum_size=1310720
esp32s3usbotg.upload.maximum_data_size=327680
esp32s3usbotg.upload.speed=921600
esp32s3usbotg.upload.flags=
esp32s3usbotg.upload.extra_flags=
esp32s3usbotg.upload.use_1200bps_touch=false
esp32s3usbotg.upload.wait_for_upload_port=false

esp32s3usbotg.serial.disableDTR=false
esp32s3usbotg.serial.disableRTS=false

esp32s3usbotg.build.tarch=xtensa
esp32s3usbotg.build.bootloader_addr=0x0
esp32s3usbotg.build.target=esp32s3
esp32s3usbotg.build.mcu=esp32s3
esp32s3usbotg.build.core=esp32
esp32s3usbotg.build.variant=esp32s3usbotg
esp32s3usbotg.build.board=ESP32_S3_USB_OTG

esp32s3usbotg.build.usb_mode=0
esp32s3usbotg.build.cdc_on_boot=0
esp32s3usbotg.build.msc_on_boot=0
esp32s3usbotg.build.dfu_on_boot=0
esp32s3usbotg.build.f_cpu=240000000L
esp32s3usbotg.build.flash_size=8MB
esp32s3usbotg.build.flash_freq=80m
esp32s3usbotg.build.flash_mode=dio
esp32s3usbotg.build.boot=qio
esp32s3usbotg.build.partitions=default
esp32s3usbotg.build.defines=
esp32s3usbotg.build.memory_type=qio_qspi
esp32s3usbotg.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32s3usbotg.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1

esp32s3usbotg.menu.USBMode.default=USB-OTG
esp32s3usbotg.menu.USBMode.default.build.usb_mode=0
esp32s3usbotg.menu.USBMode.default.build.cdc_on_boot=0
esp32s3usbotg.menu.USBMode.hwcdc=Hardware CDC and JTAG
esp32s3usbotg.menu.USBMode.hwcdc.build.usb_mode=1
esp32s3usbotg.menu.USBMode.hwcdc.build.cdc_on_boot=1

esp32s3usbotg.menu.UploadMode.default=UART0 / Hardware CDC
esp32s3usbotg.menu.UploadMode.default.upload.use_1200bps_touch=false
esp32s3usbotg.menu.UploadMode.default.upload.wait_for_upload_port=false
esp32s3usbotg.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
esp32s3usbotg.menu.UploadMode.cdc.upload.use_1200bps_touch=true
esp32s3usbotg.menu.UploadMode.cdc.upload.wait_for_upload_port=true

esp32s3usbotg.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32s3usbotg.menu.PartitionScheme.default.build.partitions=default
esp32s3usbotg.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32s3usbotg.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32s3usbotg.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32s3usbotg.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32s3usbotg.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32s3usbotg.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32s3usbotg.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32s3usbotg.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32s3usbotg.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32s3usbotg.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32s3usbotg.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32s3usbotg.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32s3usbotg.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32s3usbotg.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32s3usbotg.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32s3usbotg.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32s3usbotg.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32s3usbotg.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32s3usbotg.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32s3usbotg.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32s3usbotg.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32s3usbotg.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32s3usbotg.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32s3usbotg.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32s3usbotg.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32s3usbotg.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32s3usbotg.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s3usbotg.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32s3usbotg.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

esp32s3usbotg.menu.DebugLevel.none=None
esp32s3usbotg.menu.DebugLevel.none.build.code_debug=0
esp32s3usbotg.menu.DebugLevel.error=Error
esp32s3usbotg.menu.DebugLevel.error.build.code_debug=1
esp32s3usbotg.menu.DebugLevel.warn=Warn
esp32s3usbotg.menu.DebugLevel.warn.build.code_debug=2
esp32s3usbotg.menu.DebugLevel.info=Info
esp32s3usbotg.menu.DebugLevel.info.build.code_debug=3
esp32s3usbotg.menu.DebugLevel.debug=Debug
esp32s3usbotg.menu.DebugLevel.debug.build.code_debug=4
esp32s3usbotg.menu.DebugLevel.verbose=Verbose
esp32s3usbotg.menu.DebugLevel.verbose.build.code_debug=5

esp32s3usbotg.menu.EraseFlash.none=Disabled
esp32s3usbotg.menu.EraseFlash.none.upload.erase_cmd=
esp32s3usbotg.menu.EraseFlash.all=Enabled
esp32s3usbotg.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32s3camlcd.name=ESP32S3 CAM LCD
esp32s3camlcd.vid.0=0x303a
esp32s3camlcd.pid.0=0x1001

esp32s3camlcd.bootloader.tool=esptool_py
esp32s3camlcd.bootloader.tool.default=esptool_py

esp32s3camlcd.upload.tool=esptool_py
esp32s3camlcd.upload.tool.default=esptool_py
esp32s3camlcd.upload.tool.network=esp_ota

esp32s3camlcd.upload.maximum_size=1310720
esp32s3camlcd.upload.maximum_data_size=327680
esp32s3camlcd.upload.flags=
esp32s3camlcd.upload.extra_flags=
esp32s3camlcd.upload.use_1200bps_touch=false
esp32s3camlcd.upload.wait_for_upload_port=false

esp32s3camlcd.serial.disableDTR=false
esp32s3camlcd.serial.disableRTS=false

esp32s3camlcd.build.tarch=xtensa
esp32s3camlcd.build.bootloader_addr=0x0
esp32s3camlcd.build.target=esp32s3
esp32s3camlcd.build.mcu=esp32s3
esp32s3camlcd.build.core=esp32
esp32s3camlcd.build.variant=esp32s3camlcd
esp32s3camlcd.build.board=ESP32S3_CAM_LCD

