ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
esp32s3camlcd.build.usb_mode=1
esp32s3camlcd.build.cdc_on_boot=0
esp32s3camlcd.build.msc_on_boot=0
esp32s3camlcd.build.dfu_on_boot=0
esp32s3camlcd.build.f_cpu=240000000L
esp32s3camlcd.build.flash_size=4MB
esp32s3camlcd.build.flash_freq=80m
esp32s3camlcd.build.flash_mode=dout
esp32s3camlcd.build.boot=opi
esp32s3camlcd.build.partitions=default
esp32s3camlcd.build.defines=-DBOARD_HAS_PSRAM
esp32s3camlcd.build.memory_type=opi_opi
esp32s3camlcd.build.loop_core=
esp32s3camlcd.build.event_core=

esp32s3camlcd.menu.LoopCore.1=Core 1
esp32s3camlcd.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32s3camlcd.menu.LoopCore.0=Core 0
esp32s3camlcd.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

esp32s3camlcd.menu.EventsCore.1=Core 1
esp32s3camlcd.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32s3camlcd.menu.EventsCore.0=Core 0
esp32s3camlcd.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

esp32s3camlcd.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32s3camlcd.menu.PartitionScheme.default.build.partitions=default
esp32s3camlcd.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32s3camlcd.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32s3camlcd.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32s3camlcd.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32s3camlcd.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32s3camlcd.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32s3camlcd.menu.PartitionScheme.minimal.build.partitions=minimal
esp32s3camlcd.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32s3camlcd.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32s3camlcd.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32s3camlcd.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32s3camlcd.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32s3camlcd.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32s3camlcd.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32s3camlcd.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32s3camlcd.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32s3camlcd.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32s3camlcd.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32s3camlcd.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32s3camlcd.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32s3camlcd.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32s3camlcd.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32s3camlcd.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32s3camlcd.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32s3camlcd.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32s3camlcd.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32s3camlcd.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32s3camlcd.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32s3camlcd.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s3camlcd.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32s3camlcd.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

esp32s3camlcd.menu.UploadSpeed.921600=921600
esp32s3camlcd.menu.UploadSpeed.921600.upload.speed=921600
esp32s3camlcd.menu.UploadSpeed.115200=115200
esp32s3camlcd.menu.UploadSpeed.115200.upload.speed=115200
esp32s3camlcd.menu.UploadSpeed.256000.windows=256000
esp32s3camlcd.menu.UploadSpeed.256000.upload.speed=256000
esp32s3camlcd.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32s3camlcd.menu.UploadSpeed.230400=230400
esp32s3camlcd.menu.UploadSpeed.230400.upload.speed=230400
esp32s3camlcd.menu.UploadSpeed.460800.linux=460800
esp32s3camlcd.menu.UploadSpeed.460800.macosx=460800
esp32s3camlcd.menu.UploadSpeed.460800.upload.speed=460800
esp32s3camlcd.menu.UploadSpeed.512000.windows=512000
esp32s3camlcd.menu.UploadSpeed.512000.upload.speed=512000

esp32s3camlcd.menu.DebugLevel.none=None
esp32s3camlcd.menu.DebugLevel.none.build.code_debug=0
esp32s3camlcd.menu.DebugLevel.error=Error
esp32s3camlcd.menu.DebugLevel.error.build.code_debug=1
esp32s3camlcd.menu.DebugLevel.warn=Warn
esp32s3camlcd.menu.DebugLevel.warn.build.code_debug=2
esp32s3camlcd.menu.DebugLevel.info=Info
esp32s3camlcd.menu.DebugLevel.info.build.code_debug=3
esp32s3camlcd.menu.DebugLevel.debug=Debug
esp32s3camlcd.menu.DebugLevel.debug.build.code_debug=4
esp32s3camlcd.menu.DebugLevel.verbose=Verbose
esp32s3camlcd.menu.DebugLevel.verbose.build.code_debug=5

esp32s3camlcd.menu.EraseFlash.none=Disabled
esp32s3camlcd.menu.EraseFlash.none.upload.erase_cmd=
esp32s3camlcd.menu.EraseFlash.all=Enabled
esp32s3camlcd.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32wroverkit.name=ESP32 Wrover Kit (all versions)

esp32wroverkit.bootloader.tool=esptool_py
esp32wroverkit.bootloader.tool.default=esptool_py

esp32wroverkit.upload.tool=esptool_py
esp32wroverkit.upload.tool.default=esptool_py
esp32wroverkit.upload.tool.network=esp_ota

esp32wroverkit.upload.maximum_size=1310720
esp32wroverkit.upload.maximum_data_size=327680
esp32wroverkit.upload.flags=
esp32wroverkit.upload.extra_flags=

esp32wroverkit.serial.disableDTR=true
esp32wroverkit.serial.disableRTS=true

esp32wroverkit.build.tarch=xtensa
esp32wroverkit.build.bootloader_addr=0x1000
esp32wroverkit.build.target=esp32
esp32wroverkit.build.mcu=esp32
esp32wroverkit.build.core=esp32
esp32wroverkit.build.variant=esp32
esp32wroverkit.build.board=ESP32_WROVER_KIT

esp32wroverkit.build.f_cpu=240000000L
esp32wroverkit.build.flash_size=4MB
esp32wroverkit.build.flash_freq=40m
esp32wroverkit.build.flash_mode=dio
esp32wroverkit.build.boot=dio
esp32wroverkit.build.partitions=default

