ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
tinys3.menu.CPUFreq.240=240MHz (WiFi)
tinys3.menu.CPUFreq.240.build.f_cpu=240000000L
tinys3.menu.CPUFreq.160=160MHz (WiFi)
tinys3.menu.CPUFreq.160.build.f_cpu=160000000L
tinys3.menu.CPUFreq.80=80MHz (WiFi)
tinys3.menu.CPUFreq.80.build.f_cpu=80000000L
tinys3.menu.CPUFreq.40=40MHz
tinys3.menu.CPUFreq.40.build.f_cpu=40000000L
tinys3.menu.CPUFreq.20=20MHz
tinys3.menu.CPUFreq.20.build.f_cpu=20000000L
tinys3.menu.CPUFreq.10=10MHz
tinys3.menu.CPUFreq.10.build.f_cpu=10000000L

tinys3.menu.FlashMode.qio=QIO
tinys3.menu.FlashMode.qio.build.flash_mode=dio
tinys3.menu.FlashMode.qio.build.boot=qio
tinys3.menu.FlashMode.dio=DIO
tinys3.menu.FlashMode.dio.build.flash_mode=dio
tinys3.menu.FlashMode.dio.build.boot=dio

tinys3.menu.UploadSpeed.921600=921600
tinys3.menu.UploadSpeed.921600.upload.speed=921600
tinys3.menu.UploadSpeed.115200=115200
tinys3.menu.UploadSpeed.115200.upload.speed=115200
tinys3.menu.UploadSpeed.256000.windows=256000
tinys3.menu.UploadSpeed.256000.upload.speed=256000
tinys3.menu.UploadSpeed.230400.windows.upload.speed=256000
tinys3.menu.UploadSpeed.230400=230400
tinys3.menu.UploadSpeed.230400.upload.speed=230400
tinys3.menu.UploadSpeed.460800.linux=460800
tinys3.menu.UploadSpeed.460800.macosx=460800
tinys3.menu.UploadSpeed.460800.upload.speed=460800
tinys3.menu.UploadSpeed.512000.windows=512000
tinys3.menu.UploadSpeed.512000.upload.speed=512000

tinys3.menu.DebugLevel.none=None
tinys3.menu.DebugLevel.none.build.code_debug=0
tinys3.menu.DebugLevel.error=Error
tinys3.menu.DebugLevel.error.build.code_debug=1
tinys3.menu.DebugLevel.warn=Warn
tinys3.menu.DebugLevel.warn.build.code_debug=2
tinys3.menu.DebugLevel.info=Info
tinys3.menu.DebugLevel.info.build.code_debug=3
tinys3.menu.DebugLevel.debug=Debug
tinys3.menu.DebugLevel.debug.build.code_debug=4
tinys3.menu.DebugLevel.verbose=Verbose
tinys3.menu.DebugLevel.verbose.build.code_debug=5

tinys3.menu.EraseFlash.none=Disabled
tinys3.menu.EraseFlash.none.upload.erase_cmd=
tinys3.menu.EraseFlash.all=Enabled
tinys3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

pros3.name=UM PROS3
pros3.vid.0=0x303a
pros3.pid.0=0x80D3

pros3.bootloader.tool=esptool_py
pros3.bootloader.tool.default=esptool_py

pros3.upload.tool=esptool_py
pros3.upload.tool.default=esptool_py
pros3.upload.tool.network=esp_ota

pros3.upload.maximum_size=1310720
pros3.upload.maximum_data_size=327680
pros3.upload.flags=
pros3.upload.extra_flags=
pros3.upload.use_1200bps_touch=false
pros3.upload.wait_for_upload_port=false

pros3.serial.disableDTR=false
pros3.serial.disableRTS=false

pros3.build.tarch=xtensa
pros3.build.bootloader_addr=0x0
pros3.build.target=esp32s3
pros3.build.mcu=esp32s3
pros3.build.core=esp32
pros3.build.variant=um_pros3
pros3.build.board=PROS3

pros3.build.usb_mode=1
pros3.build.cdc_on_boot=0
pros3.build.msc_on_boot=0
pros3.build.dfu_on_boot=0
pros3.build.f_cpu=240000000L
pros3.build.flash_size=16MB
pros3.build.flash_freq=80m
pros3.build.flash_mode=dio
pros3.build.boot=qio
pros3.build.partitions=default
pros3.build.defines=
pros3.build.loop_core=
pros3.build.event_core=
pros3.build.flash_type=qio
pros3.build.psram_type=qspi
pros3.build.memory_type=qio_qspi

pros3.menu.LoopCore.1=Core 1
pros3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
pros3.menu.LoopCore.0=Core 0
pros3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

pros3.menu.EventsCore.1=Core 1
pros3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
pros3.menu.EventsCore.0=Core 0
pros3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

pros3.menu.USBMode.default=USB-OTG (TinyUSB)
pros3.menu.USBMode.default.build.usb_mode=0
pros3.menu.USBMode.hwcdc=Hardware CDC and JTAG
pros3.menu.USBMode.hwcdc.build.usb_mode=1

pros3.menu.CDCOnBoot.cdc=Enabled
pros3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
pros3.menu.CDCOnBoot.default=Disabled
pros3.menu.CDCOnBoot.default.build.cdc_on_boot=0

pros3.menu.MSCOnBoot.default=Disabled
pros3.menu.MSCOnBoot.default.build.msc_on_boot=0
pros3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
pros3.menu.MSCOnBoot.msc.build.msc_on_boot=1

pros3.menu.DFUOnBoot.default=Disabled
pros3.menu.DFUOnBoot.default.build.dfu_on_boot=0
pros3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
pros3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

pros3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
pros3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
pros3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
pros3.menu.UploadMode.default=UART0 / Hardware CDC
pros3.menu.UploadMode.default.upload.use_1200bps_touch=false
pros3.menu.UploadMode.default.upload.wait_for_upload_port=false

pros3.menu.PSRAM.enabled=Enabled
pros3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
pros3.menu.PSRAM.disabled=Disabled
pros3.menu.PSRAM.disabled.build.defines=

pros3.menu.PartitionScheme.default_16MB=Default (6.25MB APP/3.43MB SPIFFS)
pros3.menu.PartitionScheme.default_16MB.build.partitions=default_16MB
pros3.menu.PartitionScheme.default_16MB.upload.maximum_size=6553600
pros3.menu.PartitionScheme.tinyuf2=TinyUF2 Compatibility (2MB APP/12MB FFAT)
pros3.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader_tinyuf2
pros3.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions_tinyuf2
pros3.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
pros3.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152
pros3.menu.PartitionScheme.large_spiffs=Large SPIFFS (4.5MB APP/6.93MB SPIFFS)
pros3.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
pros3.menu.PartitionScheme.large_spiffs.upload.maximum_size=4718592
pros3.menu.PartitionScheme.app3M_fat9M_16MB=FFAT (3MB APP/9MB FATFS)
pros3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
pros3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
pros3.menu.PartitionScheme.fatflash=Large FFAT (2MB APP/12.5MB FATFS)
pros3.menu.PartitionScheme.fatflash.build.partitions=ffat
pros3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152

