ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
feathers3.menu.UploadSpeed.921600=921600
feathers3.menu.UploadSpeed.921600.upload.speed=921600
feathers3.menu.UploadSpeed.115200=115200
feathers3.menu.UploadSpeed.115200.upload.speed=115200
feathers3.menu.UploadSpeed.256000.windows=256000
feathers3.menu.UploadSpeed.256000.upload.speed=256000
feathers3.menu.UploadSpeed.230400.windows.upload.speed=256000
feathers3.menu.UploadSpeed.230400=230400
feathers3.menu.UploadSpeed.230400.upload.speed=230400
feathers3.menu.UploadSpeed.460800.linux=460800
feathers3.menu.UploadSpeed.460800.macosx=460800
feathers3.menu.UploadSpeed.460800.upload.speed=460800
feathers3.menu.UploadSpeed.512000.windows=512000
feathers3.menu.UploadSpeed.512000.upload.speed=512000

feathers3.menu.DebugLevel.none=None
feathers3.menu.DebugLevel.none.build.code_debug=0
feathers3.menu.DebugLevel.error=Error
feathers3.menu.DebugLevel.error.build.code_debug=1
feathers3.menu.DebugLevel.warn=Warn
feathers3.menu.DebugLevel.warn.build.code_debug=2
feathers3.menu.DebugLevel.info=Info
feathers3.menu.DebugLevel.info.build.code_debug=3
feathers3.menu.DebugLevel.debug=Debug
feathers3.menu.DebugLevel.debug.build.code_debug=4
feathers3.menu.DebugLevel.verbose=Verbose
feathers3.menu.DebugLevel.verbose.build.code_debug=5

feathers3.menu.EraseFlash.none=Disabled
feathers3.menu.EraseFlash.none.upload.erase_cmd=
feathers3.menu.EraseFlash.all=Enabled
feathers3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

S_ODI_Ultra.name=S.ODI Ultra v1

S_ODI_Ultra.bootloader.tool=esptool_py
S_ODI_Ultra.bootloader.tool.default=esptool_py

S_ODI_Ultra.upload.tool=esptool_py
S_ODI_Ultra.upload.tool.default=esptool_py
S_ODI_Ultra.upload.tool.network=esp_ota

S_ODI_Ultra.upload.maximum_size=1310720
S_ODI_Ultra.upload.maximum_data_size=327680
S_ODI_Ultra.upload.wait_for_upload_port=true
S_ODI_Ultra.upload.flags=
S_ODI_Ultra.upload.extra_flags=

S_ODI_Ultra.serial.disableDTR=true
S_ODI_Ultra.serial.disableRTS=true

S_ODI_Ultra.build.tarch=xtensa
S_ODI_Ultra.build.bootloader_addr=0x1000
S_ODI_Ultra.build.target=esp32
S_ODI_Ultra.build.mcu=esp32
S_ODI_Ultra.build.core=esp32
S_ODI_Ultra.build.variant=S_ODI_Ultra_v1
S_ODI_Ultra.build.board=ESP32_DEV

S_ODI_Ultra.build.f_cpu=240000000L
S_ODI_Ultra.build.flash_mode=dio
S_ODI_Ultra.build.flash_size=4MB
S_ODI_Ultra.build.boot=dio
S_ODI_Ultra.build.partitions=default
S_ODI_Ultra.build.defines=

S_ODI_Ultra.menu.FlashFreq.80=80MHz
S_ODI_Ultra.menu.FlashFreq.80.build.flash_freq=80m
S_ODI_Ultra.menu.FlashFreq.40=40MHz
S_ODI_Ultra.menu.FlashFreq.40.build.flash_freq=40m

S_ODI_Ultra.menu.UploadSpeed.921600=921600
S_ODI_Ultra.menu.UploadSpeed.921600.upload.speed=921600
S_ODI_Ultra.menu.UploadSpeed.115200=115200
S_ODI_Ultra.menu.UploadSpeed.115200.upload.speed=115200
S_ODI_Ultra.menu.UploadSpeed.256000.windows=256000
S_ODI_Ultra.menu.UploadSpeed.256000.upload.speed=256000
S_ODI_Ultra.menu.UploadSpeed.230400.windows.upload.speed=256000
S_ODI_Ultra.menu.UploadSpeed.230400=230400
S_ODI_Ultra.menu.UploadSpeed.230400.upload.speed=230400
S_ODI_Ultra.menu.UploadSpeed.460800.linux=460800
S_ODI_Ultra.menu.UploadSpeed.460800.macosx=460800
S_ODI_Ultra.menu.UploadSpeed.460800.upload.speed=460800
S_ODI_Ultra.menu.UploadSpeed.512000.windows=512000
S_ODI_Ultra.menu.UploadSpeed.512000.upload.speed=512000

S_ODI_Ultra.menu.DebugLevel.none=None
S_ODI_Ultra.menu.DebugLevel.none.build.code_debug=0
S_ODI_Ultra.menu.DebugLevel.error=Error
S_ODI_Ultra.menu.DebugLevel.error.build.code_debug=1
S_ODI_Ultra.menu.DebugLevel.warn=Warn
S_ODI_Ultra.menu.DebugLevel.warn.build.code_debug=2
S_ODI_Ultra.menu.DebugLevel.info=Info
S_ODI_Ultra.menu.DebugLevel.info.build.code_debug=3
S_ODI_Ultra.menu.DebugLevel.debug=Debug
S_ODI_Ultra.menu.DebugLevel.debug.build.code_debug=4

S_ODI_Ultra.menu.EraseFlash.none=Disabled
S_ODI_Ultra.menu.EraseFlash.none.upload.erase_cmd=
S_ODI_Ultra.menu.EraseFlash.all=Enabled
S_ODI_Ultra.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

lilygo_t_display_s3.name=LilyGo T-Display-S3
lilygo_t_display_s3.vid.0=0x303a
lilygo_t_display_s3.pid.0=0x1001

lilygo_t_display_s3.bootloader.tool=esptool_py
lilygo_t_display_s3.bootloader.tool.default=esptool_py

lilygo_t_display_s3.upload.tool=esptool_py
lilygo_t_display_s3.upload.tool.default=esptool_py
lilygo_t_display_s3.upload.tool.network=esp_ota

lilygo_t_display_s3.upload.maximum_size=3145728
lilygo_t_display_s3.upload.maximum_data_size=327680
lilygo_t_display_s3.upload.speed=921600
lilygo_t_display_s3.upload.flags=
lilygo_t_display_s3.upload.extra_flags=
lilygo_t_display_s3.upload.use_1200bps_touch=false
lilygo_t_display_s3.upload.wait_for_upload_port=false

lilygo_t_display_s3.serial.disableDTR=false
lilygo_t_display_s3.serial.disableRTS=false

lilygo_t_display_s3.build.tarch=xtensa
lilygo_t_display_s3.build.bootloader_addr=0x0
lilygo_t_display_s3.build.target=esp32s3
lilygo_t_display_s3.build.mcu=esp32s3
lilygo_t_display_s3.build.core=esp32
lilygo_t_display_s3.build.variant=lilygo_t_display_s3
lilygo_t_display_s3.build.board=LILYGO_T_DISPLAY_S3

lilygo_t_display_s3.build.usb_mode=1
lilygo_t_display_s3.build.cdc_on_boot=1
lilygo_t_display_s3.build.msc_on_boot=0
lilygo_t_display_s3.build.dfu_on_boot=0
lilygo_t_display_s3.build.f_cpu=240000000L
lilygo_t_display_s3.build.flash_size=16MB
lilygo_t_display_s3.build.flash_freq=80m
lilygo_t_display_s3.build.flash_mode=dio
lilygo_t_display_s3.build.boot=qio
lilygo_t_display_s3.build.boot_freq=80m
lilygo_t_display_s3.build.partitions=app3M_fat9M_16MB
lilygo_t_display_s3.build.defines=
lilygo_t_display_s3.build.loop_core=
lilygo_t_display_s3.build.event_core=
lilygo_t_display_s3.build.psram_type=opi
lilygo_t_display_s3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
lilygo_t_display_s3.menu.JTAGAdapter.default=Disabled
lilygo_t_display_s3.menu.JTAGAdapter.default.build.copy_jtag_files=0
lilygo_t_display_s3.menu.JTAGAdapter.builtin=Integrated USB JTAG
lilygo_t_display_s3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
lilygo_t_display_s3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1

