ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
##############################################################

nina_w10.name=u-blox NINA-W10 series (ESP32)

nina_w10.bootloader.tool=esptool_py
nina_w10.bootloader.tool.default=esptool_py

nina_w10.upload.tool=esptool_py
nina_w10.upload.tool.default=esptool_py
nina_w10.upload.tool.network=esp_ota

nina_w10.upload.maximum_size=1310720
nina_w10.upload.maximum_data_size=327680
nina_w10.upload.flags=
nina_w10.upload.extra_flags=

nina_w10.serial.disableDTR=true
nina_w10.serial.disableRTS=true

nina_w10.build.tarch=xtensa
nina_w10.build.bootloader_addr=0x1000
nina_w10.build.target=esp32
nina_w10.build.mcu=esp32
nina_w10.build.core=esp32
nina_w10.build.variant=nina_w10
nina_w10.build.board=UBLOX_NINA_W10
nina_w10.build.f_cpu=240000000L
nina_w10.build.boot=dio
nina_w10.build.partitions=minimal
nina_w10.build.flash_mode=dio
nina_w10.build.flash_size=2MB
nina_w10.build.flash_freq=40m
nina_w10.build.defines=
nina_w10.build.extra_libs=
nina_w10.build.loop_core=
nina_w10.build.event_core=

nina_w10.menu.UploadSpeed.921600=921600
nina_w10.menu.UploadSpeed.921600.upload.speed=921600
nina_w10.menu.UploadSpeed.115200=115200
nina_w10.menu.UploadSpeed.115200.upload.speed=115200
nina_w10.menu.UploadSpeed.256000.windows=256000
nina_w10.menu.UploadSpeed.256000.upload.speed=256000
nina_w10.menu.UploadSpeed.230400.windows.upload.speed=256000
nina_w10.menu.UploadSpeed.230400=230400
nina_w10.menu.UploadSpeed.230400.upload.speed=230400
nina_w10.menu.UploadSpeed.460800.linux=460800
nina_w10.menu.UploadSpeed.460800.macosx=460800
nina_w10.menu.UploadSpeed.460800.upload.speed=460800
nina_w10.menu.UploadSpeed.512000.windows=512000
nina_w10.menu.UploadSpeed.512000.upload.speed=512000

nina_w10.menu.FlashSize.2M=2MB (16Mb, NINA-W101/W102)
nina_w10.menu.FlashSize.2M.build.flash_size=2MB
nina_w10.menu.FlashSize.2M.build.partitions=minimal
nina_w10.menu.FlashSize.4M=4MB (32Mb, NINA-W106-00B)
nina_w10.menu.FlashSize.4M.build.flash_size=4MB
nina_w10.menu.FlashSize.4M.build.partitions=default
nina_w10.menu.FlashSize.8M=8MB (64Mb, NINA-W106-10B)
nina_w10.menu.FlashSize.8M.build.flash_size=8MB
nina_w10.menu.FlashSize.8M.build.partitions=default_8MB

nina_w10.menu.FlashFreq.80=80MHz
nina_w10.menu.FlashFreq.80.build.flash_freq=80m
nina_w10.menu.FlashFreq.40=40MHz
nina_w10.menu.FlashFreq.40.build.flash_freq=40m

nina_w10.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
nina_w10.menu.PartitionScheme.minimal.build.partitions=minimal
nina_w10.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
nina_w10.menu.PartitionScheme.default.build.partitions=default
nina_w10.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
nina_w10.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
nina_w10.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
nina_w10.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
nina_w10.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
nina_w10.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
nina_w10.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
nina_w10.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
nina_w10.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
nina_w10.menu.PartitionScheme.no_ota.build.partitions=no_ota
nina_w10.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
nina_w10.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
nina_w10.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
nina_w10.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
nina_w10.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
nina_w10.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
nina_w10.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
nina_w10.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
nina_w10.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
nina_w10.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
nina_w10.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
nina_w10.menu.PartitionScheme.huge_app.build.partitions=huge_app
nina_w10.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
nina_w10.menu.PartitionScheme.rainmaker=RainMaker
nina_w10.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
nina_w10.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

nina_w10.menu.CPUFreq.240=240MHz (WiFi/BT)
nina_w10.menu.CPUFreq.240.build.f_cpu=240000000L
nina_w10.menu.CPUFreq.160=160MHz (WiFi/BT)
nina_w10.menu.CPUFreq.160.build.f_cpu=160000000L
nina_w10.menu.CPUFreq.80=80MHz (WiFi/BT)
nina_w10.menu.CPUFreq.80.build.f_cpu=80000000L
nina_w10.menu.CPUFreq.40=40MHz (40MHz XTAL)
nina_w10.menu.CPUFreq.40.build.f_cpu=40000000L
nina_w10.menu.CPUFreq.26=26MHz (26MHz XTAL)
nina_w10.menu.CPUFreq.26.build.f_cpu=26000000L
nina_w10.menu.CPUFreq.20=20MHz (40MHz XTAL)
nina_w10.menu.CPUFreq.20.build.f_cpu=20000000L
nina_w10.menu.CPUFreq.13=13MHz (26MHz XTAL)
nina_w10.menu.CPUFreq.13.build.f_cpu=13000000L
nina_w10.menu.CPUFreq.10=10MHz (40MHz XTAL)
nina_w10.menu.CPUFreq.10.build.f_cpu=10000000L

nina_w10.menu.LoopCore.1=Core 1
nina_w10.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
nina_w10.menu.LoopCore.0=Core 0
nina_w10.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

nina_w10.menu.EventsCore.1=Core 1
nina_w10.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
nina_w10.menu.EventsCore.0=Core 0
nina_w10.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

nina_w10.menu.DebugLevel.none=None
nina_w10.menu.DebugLevel.none.build.code_debug=0
nina_w10.menu.DebugLevel.error=Error
nina_w10.menu.DebugLevel.error.build.code_debug=1
nina_w10.menu.DebugLevel.warn=Warn
nina_w10.menu.DebugLevel.warn.build.code_debug=2
nina_w10.menu.DebugLevel.info=Info
nina_w10.menu.DebugLevel.info.build.code_debug=3
nina_w10.menu.DebugLevel.debug=Debug
nina_w10.menu.DebugLevel.debug.build.code_debug=4
nina_w10.menu.DebugLevel.verbose=Verbose
nina_w10.menu.DebugLevel.verbose.build.code_debug=5

nina_w10.menu.EraseFlash.none=Disabled
nina_w10.menu.EraseFlash.none.upload.erase_cmd=
nina_w10.menu.EraseFlash.all=Enabled
nina_w10.menu.EraseFlash.all.upload.erase_cmd=-e

