ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
lolin_s3_pro.menu.FlashMode.qio=QIO 80MHz
lolin_s3_pro.menu.FlashMode.qio.build.flash_mode=dio
lolin_s3_pro.menu.FlashMode.qio.build.boot=qio
lolin_s3_pro.menu.FlashMode.qio.build.boot_freq=80m
lolin_s3_pro.menu.FlashMode.qio.build.flash_freq=80m
lolin_s3_pro.menu.FlashMode.qio120=QIO 120MHz
lolin_s3_pro.menu.FlashMode.qio120.build.flash_mode=dio
lolin_s3_pro.menu.FlashMode.qio120.build.boot=qio
lolin_s3_pro.menu.FlashMode.qio120.build.boot_freq=120m
lolin_s3_pro.menu.FlashMode.qio120.build.flash_freq=80m

lolin_s3_pro.menu.LoopCore.1=Core 1
lolin_s3_pro.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
lolin_s3_pro.menu.LoopCore.0=Core 0
lolin_s3_pro.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

lolin_s3_pro.menu.EventsCore.1=Core 1
lolin_s3_pro.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
lolin_s3_pro.menu.EventsCore.0=Core 0
lolin_s3_pro.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

lolin_s3_pro.menu.USBMode.hwcdc=Hardware CDC and JTAG
lolin_s3_pro.menu.USBMode.hwcdc.build.usb_mode=1
lolin_s3_pro.menu.USBMode.default=USB-OTG (TinyUSB)
lolin_s3_pro.menu.USBMode.default.build.usb_mode=0

lolin_s3_pro.menu.CDCOnBoot.default=Disabled
lolin_s3_pro.menu.CDCOnBoot.default.build.cdc_on_boot=0
lolin_s3_pro.menu.CDCOnBoot.cdc=Enabled
lolin_s3_pro.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

lolin_s3_pro.menu.MSCOnBoot.default=Disabled
lolin_s3_pro.menu.MSCOnBoot.default.build.msc_on_boot=0
lolin_s3_pro.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
lolin_s3_pro.menu.MSCOnBoot.msc.build.msc_on_boot=1

lolin_s3_pro.menu.DFUOnBoot.default=Disabled
lolin_s3_pro.menu.DFUOnBoot.default.build.dfu_on_boot=0
lolin_s3_pro.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
lolin_s3_pro.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

lolin_s3_pro.menu.UploadMode.default=UART0 / Hardware CDC
lolin_s3_pro.menu.UploadMode.default.upload.use_1200bps_touch=false
lolin_s3_pro.menu.UploadMode.default.upload.wait_for_upload_port=false
lolin_s3_pro.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
lolin_s3_pro.menu.UploadMode.cdc.upload.use_1200bps_touch=true
lolin_s3_pro.menu.UploadMode.cdc.upload.wait_for_upload_port=true

lolin_s3_pro.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
lolin_s3_pro.menu.PartitionScheme.fatflash.build.partitions=ffat
lolin_s3_pro.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
lolin_s3_pro.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
lolin_s3_pro.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
lolin_s3_pro.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
lolin_s3_pro.menu.PartitionScheme.rainmaker=RainMaker
lolin_s3_pro.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
lolin_s3_pro.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

lolin_s3_pro.menu.CPUFreq.240=240MHz (WiFi)
lolin_s3_pro.menu.CPUFreq.240.build.f_cpu=240000000L
lolin_s3_pro.menu.CPUFreq.160=160MHz (WiFi)
lolin_s3_pro.menu.CPUFreq.160.build.f_cpu=160000000L
lolin_s3_pro.menu.CPUFreq.80=80MHz (WiFi)
lolin_s3_pro.menu.CPUFreq.80.build.f_cpu=80000000L
lolin_s3_pro.menu.CPUFreq.40=40MHz
lolin_s3_pro.menu.CPUFreq.40.build.f_cpu=40000000L
lolin_s3_pro.menu.CPUFreq.20=20MHz
lolin_s3_pro.menu.CPUFreq.20.build.f_cpu=20000000L
lolin_s3_pro.menu.CPUFreq.10=10MHz
lolin_s3_pro.menu.CPUFreq.10.build.f_cpu=10000000L

lolin_s3_pro.menu.UploadSpeed.921600=921600
lolin_s3_pro.menu.UploadSpeed.921600.upload.speed=921600
lolin_s3_pro.menu.UploadSpeed.115200=115200
lolin_s3_pro.menu.UploadSpeed.115200.upload.speed=115200
lolin_s3_pro.menu.UploadSpeed.256000.windows=256000
lolin_s3_pro.menu.UploadSpeed.256000.upload.speed=256000
lolin_s3_pro.menu.UploadSpeed.230400.windows.upload.speed=256000
lolin_s3_pro.menu.UploadSpeed.230400=230400
lolin_s3_pro.menu.UploadSpeed.230400.upload.speed=230400
lolin_s3_pro.menu.UploadSpeed.460800.linux=460800
lolin_s3_pro.menu.UploadSpeed.460800.macosx=460800
lolin_s3_pro.menu.UploadSpeed.460800.upload.speed=460800
lolin_s3_pro.menu.UploadSpeed.512000.windows=512000
lolin_s3_pro.menu.UploadSpeed.512000.upload.speed=512000

lolin_s3_pro.menu.DebugLevel.none=None
lolin_s3_pro.menu.DebugLevel.none.build.code_debug=0
lolin_s3_pro.menu.DebugLevel.error=Error
lolin_s3_pro.menu.DebugLevel.error.build.code_debug=1
lolin_s3_pro.menu.DebugLevel.warn=Warn
lolin_s3_pro.menu.DebugLevel.warn.build.code_debug=2
lolin_s3_pro.menu.DebugLevel.info=Info
lolin_s3_pro.menu.DebugLevel.info.build.code_debug=3
lolin_s3_pro.menu.DebugLevel.debug=Debug
lolin_s3_pro.menu.DebugLevel.debug.build.code_debug=4
lolin_s3_pro.menu.DebugLevel.verbose=Verbose
lolin_s3_pro.menu.DebugLevel.verbose.build.code_debug=5

lolin_s3_pro.menu.EraseFlash.none=Disabled
lolin_s3_pro.menu.EraseFlash.none.upload.erase_cmd=
lolin_s3_pro.menu.EraseFlash.all=Enabled
lolin_s3_pro.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

lolin32.name=WEMOS LOLIN32

lolin32.bootloader.tool=esptool_py
lolin32.bootloader.tool.default=esptool_py

lolin32.upload.tool=esptool_py
lolin32.upload.tool.default=esptool_py
lolin32.upload.tool.network=esp_ota

lolin32.upload.maximum_size=1310720
lolin32.upload.maximum_data_size=327680
lolin32.upload.flags=
lolin32.upload.extra_flags=

lolin32.serial.disableDTR=true
lolin32.serial.disableRTS=true

lolin32.build.tarch=xtensa
lolin32.build.bootloader_addr=0x1000
lolin32.build.target=esp32
lolin32.build.mcu=esp32
lolin32.build.core=esp32
lolin32.build.variant=lolin32
lolin32.build.board=LOLIN32

lolin32.build.f_cpu=240000000L
lolin32.build.flash_mode=dio
lolin32.build.flash_size=4MB
lolin32.build.boot=dio
lolin32.build.partitions=default
lolin32.build.defines=

lolin32.menu.FlashFreq.80=80MHz
lolin32.menu.FlashFreq.80.build.flash_freq=80m
lolin32.menu.FlashFreq.40=40MHz
lolin32.menu.FlashFreq.40.build.flash_freq=40m

lolin32.menu.PartitionScheme.default=Default
lolin32.menu.PartitionScheme.default.build.partitions=default
lolin32.menu.PartitionScheme.no_ota=No OTA (Large APP)
lolin32.menu.PartitionScheme.no_ota.build.partitions=no_ota
lolin32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
lolin32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
lolin32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
lolin32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

lolin32.menu.CPUFreq.240=240MHz (WiFi/BT)
lolin32.menu.CPUFreq.240.build.f_cpu=240000000L
lolin32.menu.CPUFreq.160=160MHz (WiFi/BT)
lolin32.menu.CPUFreq.160.build.f_cpu=160000000L
lolin32.menu.CPUFreq.80=80MHz (WiFi/BT)
lolin32.menu.CPUFreq.80.build.f_cpu=80000000L
lolin32.menu.CPUFreq.40=40MHz (40MHz XTAL)
lolin32.menu.CPUFreq.40.build.f_cpu=40000000L
lolin32.menu.CPUFreq.26=26MHz (26MHz XTAL)
lolin32.menu.CPUFreq.26.build.f_cpu=26000000L
lolin32.menu.CPUFreq.20=20MHz (40MHz XTAL)
lolin32.menu.CPUFreq.20.build.f_cpu=20000000L
lolin32.menu.CPUFreq.13=13MHz (26MHz XTAL)
lolin32.menu.CPUFreq.13.build.f_cpu=13000000L
lolin32.menu.CPUFreq.10=10MHz (40MHz XTAL)
lolin32.menu.CPUFreq.10.build.f_cpu=10000000L

lolin32.menu.UploadSpeed.921600=921600
lolin32.menu.UploadSpeed.921600.upload.speed=921600
lolin32.menu.UploadSpeed.115200=115200
lolin32.menu.UploadSpeed.115200.upload.speed=115200
lolin32.menu.UploadSpeed.256000.windows=256000
lolin32.menu.UploadSpeed.256000.upload.speed=256000
lolin32.menu.UploadSpeed.230400.windows.upload.speed=256000
lolin32.menu.UploadSpeed.230400=230400
lolin32.menu.UploadSpeed.230400.upload.speed=230400
lolin32.menu.UploadSpeed.460800.linux=460800
lolin32.menu.UploadSpeed.460800.macosx=460800
lolin32.menu.UploadSpeed.460800.upload.speed=460800
lolin32.menu.UploadSpeed.512000.windows=512000
lolin32.menu.UploadSpeed.512000.upload.speed=512000

lolin32.menu.DebugLevel.none=None
lolin32.menu.DebugLevel.none.build.code_debug=0
lolin32.menu.DebugLevel.error=Error
lolin32.menu.DebugLevel.error.build.code_debug=1
lolin32.menu.DebugLevel.warn=Warn
lolin32.menu.DebugLevel.warn.build.code_debug=2
lolin32.menu.DebugLevel.info=Info
lolin32.menu.DebugLevel.info.build.code_debug=3
lolin32.menu.DebugLevel.debug=Debug
lolin32.menu.DebugLevel.debug.build.code_debug=4
lolin32.menu.DebugLevel.verbose=Verbose
lolin32.menu.DebugLevel.verbose.build.code_debug=5

