ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
##############################################################

quantum.name=Noduino Quantum

quantum.bootloader.tool=esptool_py
quantum.bootloader.tool.default=esptool_py

quantum.upload.tool=esptool_py
quantum.upload.tool.default=esptool_py
quantum.upload.tool.network=esp_ota

quantum.upload.maximum_size=1310720
quantum.upload.maximum_data_size=327680
quantum.upload.flags=
quantum.upload.extra_flags=

quantum.serial.disableDTR=true
quantum.serial.disableRTS=true

quantum.build.tarch=xtensa
quantum.build.bootloader_addr=0x1000
quantum.build.target=esp32
quantum.build.mcu=esp32
quantum.build.core=esp32
quantum.build.variant=quantum
quantum.build.board=QUANTUM

quantum.build.f_cpu=240000000L
quantum.build.flash_mode=qio
quantum.build.flash_size=16MB
quantum.build.boot=dio
quantum.build.partitions=default
quantum.build.defines=

quantum.menu.FlashFreq.80=80MHz
quantum.menu.FlashFreq.80.build.flash_freq=80m
quantum.menu.FlashFreq.40=40MHz
quantum.menu.FlashFreq.40.build.flash_freq=40m

quantum.menu.UploadSpeed.921600=921600
quantum.menu.UploadSpeed.921600.upload.speed=921600
quantum.menu.UploadSpeed.115200=115200
quantum.menu.UploadSpeed.115200.upload.speed=115200
quantum.menu.UploadSpeed.256000.windows=256000
quantum.menu.UploadSpeed.256000.upload.speed=256000
quantum.menu.UploadSpeed.230400.windows.upload.speed=256000
quantum.menu.UploadSpeed.230400=230400
quantum.menu.UploadSpeed.230400.upload.speed=230400
quantum.menu.UploadSpeed.460800.linux=460800
quantum.menu.UploadSpeed.460800.macosx=460800
quantum.menu.UploadSpeed.460800.upload.speed=460800
quantum.menu.UploadSpeed.512000.windows=512000
quantum.menu.UploadSpeed.512000.upload.speed=512000

quantum.menu.DebugLevel.none=None
quantum.menu.DebugLevel.none.build.code_debug=0
quantum.menu.DebugLevel.error=Error
quantum.menu.DebugLevel.error.build.code_debug=1
quantum.menu.DebugLevel.warn=Warn
quantum.menu.DebugLevel.warn.build.code_debug=2
quantum.menu.DebugLevel.info=Info
quantum.menu.DebugLevel.info.build.code_debug=3
quantum.menu.DebugLevel.debug=Debug
quantum.menu.DebugLevel.debug.build.code_debug=4
quantum.menu.DebugLevel.verbose=Verbose
quantum.menu.DebugLevel.verbose.build.code_debug=5

quantum.menu.EraseFlash.none=Disabled
quantum.menu.EraseFlash.none.upload.erase_cmd=
quantum.menu.EraseFlash.all=Enabled
quantum.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

node32s.name=Node32s

node32s.bootloader.tool=esptool_py
node32s.bootloader.tool.default=esptool_py

node32s.upload.tool=esptool_py
node32s.upload.tool.default=esptool_py
node32s.upload.tool.network=esp_ota

node32s.upload.maximum_size=1310720
node32s.upload.maximum_data_size=327680
node32s.upload.flags=
node32s.upload.extra_flags=

node32s.serial.disableDTR=true
node32s.serial.disableRTS=true

node32s.build.tarch=xtensa
node32s.build.bootloader_addr=0x1000
node32s.build.target=esp32
node32s.build.mcu=esp32
node32s.build.core=esp32
node32s.build.variant=node32s
node32s.build.board=Node32s

node32s.build.f_cpu=240000000L
node32s.build.flash_mode=dio
node32s.build.flash_size=4MB
node32s.build.boot=dio
node32s.build.partitions=default
node32s.build.defines=

node32s.menu.PartitionScheme.default=Default
node32s.menu.PartitionScheme.default.build.partitions=default
node32s.menu.PartitionScheme.no_ota=No OTA (Large APP)
node32s.menu.PartitionScheme.no_ota.build.partitions=no_ota
node32s.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
node32s.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
node32s.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
node32s.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

node32s.menu.FlashFreq.80=80MHz
node32s.menu.FlashFreq.80.build.flash_freq=80m
node32s.menu.FlashFreq.40=40MHz
node32s.menu.FlashFreq.40.build.flash_freq=40m

node32s.menu.UploadSpeed.921600=921600
node32s.menu.UploadSpeed.921600.upload.speed=921600
node32s.menu.UploadSpeed.115200=115200
node32s.menu.UploadSpeed.115200.upload.speed=115200
node32s.menu.UploadSpeed.256000.windows=256000
node32s.menu.UploadSpeed.256000.upload.speed=256000
node32s.menu.UploadSpeed.230400.windows.upload.speed=256000
node32s.menu.UploadSpeed.230400=230400
node32s.menu.UploadSpeed.230400.upload.speed=230400
node32s.menu.UploadSpeed.460800.linux=460800
node32s.menu.UploadSpeed.460800.macosx=460800
node32s.menu.UploadSpeed.460800.upload.speed=460800
node32s.menu.UploadSpeed.512000.windows=512000
node32s.menu.UploadSpeed.512000.upload.speed=512000

node32s.menu.DebugLevel.none=None
node32s.menu.DebugLevel.none.build.code_debug=0
node32s.menu.DebugLevel.error=Error
node32s.menu.DebugLevel.error.build.code_debug=1
node32s.menu.DebugLevel.warn=Warn
node32s.menu.DebugLevel.warn.build.code_debug=2
node32s.menu.DebugLevel.info=Info
node32s.menu.DebugLevel.info.build.code_debug=3
node32s.menu.DebugLevel.debug=Debug
node32s.menu.DebugLevel.debug.build.code_debug=4
node32s.menu.DebugLevel.verbose=Verbose
node32s.menu.DebugLevel.verbose.build.code_debug=5

node32s.menu.EraseFlash.none=Disabled
node32s.menu.EraseFlash.none.upload.erase_cmd=
node32s.menu.EraseFlash.all=Enabled
node32s.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

hornbill32dev.name=Hornbill ESP32 Dev

hornbill32dev.bootloader.tool=esptool_py
hornbill32dev.bootloader.tool.default=esptool_py

hornbill32dev.upload.tool=esptool_py
hornbill32dev.upload.tool.default=esptool_py
hornbill32dev.upload.tool.network=esp_ota

hornbill32dev.upload.maximum_size=1310720
hornbill32dev.upload.maximum_data_size=327680
hornbill32dev.upload.flags=
hornbill32dev.upload.extra_flags=

hornbill32dev.serial.disableDTR=true
hornbill32dev.serial.disableRTS=true

hornbill32dev.build.tarch=xtensa
hornbill32dev.build.bootloader_addr=0x1000
hornbill32dev.build.target=esp32
hornbill32dev.build.mcu=esp32
hornbill32dev.build.core=esp32
hornbill32dev.build.variant=hornbill32dev
hornbill32dev.build.board=HORNBILL_ESP32_DEV

hornbill32dev.build.f_cpu=240000000L
hornbill32dev.build.flash_mode=dio
hornbill32dev.build.flash_size=4MB
hornbill32dev.build.boot=dio
hornbill32dev.build.partitions=default
hornbill32dev.build.defines=

hornbill32dev.menu.FlashFreq.80=80MHz
hornbill32dev.menu.FlashFreq.80.build.flash_freq=80m
hornbill32dev.menu.FlashFreq.40=40MHz
hornbill32dev.menu.FlashFreq.40.build.flash_freq=40m

hornbill32dev.menu.UploadSpeed.921600=921600
hornbill32dev.menu.UploadSpeed.921600.upload.speed=921600
hornbill32dev.menu.UploadSpeed.115200=115200
hornbill32dev.menu.UploadSpeed.115200.upload.speed=115200
hornbill32dev.menu.UploadSpeed.256000.windows=256000
hornbill32dev.menu.UploadSpeed.256000.upload.speed=256000
hornbill32dev.menu.UploadSpeed.230400.windows.upload.speed=256000
hornbill32dev.menu.UploadSpeed.230400=230400
hornbill32dev.menu.UploadSpeed.230400.upload.speed=230400
hornbill32dev.menu.UploadSpeed.460800.linux=460800
hornbill32dev.menu.UploadSpeed.460800.macosx=460800
hornbill32dev.menu.UploadSpeed.460800.upload.speed=460800
hornbill32dev.menu.UploadSpeed.512000.windows=512000
hornbill32dev.menu.UploadSpeed.512000.upload.speed=512000

hornbill32dev.menu.DebugLevel.none=None
hornbill32dev.menu.DebugLevel.none.build.code_debug=0
hornbill32dev.menu.DebugLevel.error=Error
hornbill32dev.menu.DebugLevel.error.build.code_debug=1
hornbill32dev.menu.DebugLevel.warn=Warn
hornbill32dev.menu.DebugLevel.warn.build.code_debug=2
hornbill32dev.menu.DebugLevel.info=Info
hornbill32dev.menu.DebugLevel.info.build.code_debug=3
hornbill32dev.menu.DebugLevel.debug=Debug
hornbill32dev.menu.DebugLevel.debug.build.code_debug=4
hornbill32dev.menu.DebugLevel.verbose=Verbose
hornbill32dev.menu.DebugLevel.verbose.build.code_debug=5

hornbill32dev.menu.EraseFlash.none=Disabled
hornbill32dev.menu.EraseFlash.none.upload.erase_cmd=
hornbill32dev.menu.EraseFlash.all=Enabled
hornbill32dev.menu.EraseFlash.all.upload.erase_cmd=-e

