ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.none=None
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.none.build.code_debug=0
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.error=Error
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.error.build.code_debug=1
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.warn=Warn
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.warn.build.code_debug=2
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.info=Info
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.info.build.code_debug=3
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.debug=Debug
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.debug.build.code_debug=4
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.verbose=Verbose
dfrobot_firebeetle2_esp32s3.menu.DebugLevel.verbose.build.code_debug=5

dfrobot_firebeetle2_esp32s3.menu.EraseFlash.none=Disabled
dfrobot_firebeetle2_esp32s3.menu.EraseFlash.none.upload.erase_cmd=
dfrobot_firebeetle2_esp32s3.menu.EraseFlash.all=Enabled
dfrobot_firebeetle2_esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# dfrobot Romeo ESP32-S3
dfrobot_romeo_esp32s3.name=DFRobot Romeo ESP32-S3
dfrobot_romeo_esp32s3.vid.0=0x303a
dfrobot_romeo_esp32s3.pid.0=0x1001

dfrobot_romeo_esp32s3.bootloader.tool=esptool_py
dfrobot_romeo_esp32s3.bootloader.tool.default=esptool_py

dfrobot_romeo_esp32s3.upload.tool=esptool_py
dfrobot_romeo_esp32s3.upload.tool.default=esptool_py
dfrobot_romeo_esp32s3.upload.tool.network=esp_ota

dfrobot_romeo_esp32s3.upload.maximum_size=1310720
dfrobot_romeo_esp32s3.upload.maximum_data_size=327680
dfrobot_romeo_esp32s3.upload.flags=
dfrobot_romeo_esp32s3.upload.extra_flags=
dfrobot_romeo_esp32s3.upload.use_1200bps_touch=false
dfrobot_romeo_esp32s3.upload.wait_for_upload_port=false

dfrobot_romeo_esp32s3.serial.disableDTR=false
dfrobot_romeo_esp32s3.serial.disableRTS=false

dfrobot_romeo_esp32s3.build.tarch=xtensa
dfrobot_romeo_esp32s3.build.bootloader_addr=0x0
dfrobot_romeo_esp32s3.build.target=esp32s3
dfrobot_romeo_esp32s3.build.mcu=esp32s3
dfrobot_romeo_esp32s3.build.core=esp32
dfrobot_romeo_esp32s3.build.variant=dfrobot_romeo_esp32s3
dfrobot_romeo_esp32s3.build.board=DFROBOT_ROMEO_ESP32S3


dfrobot_romeo_esp32s3.build.usb_mode=1
dfrobot_romeo_esp32s3.build.cdc_on_boot=0
dfrobot_romeo_esp32s3.build.msc_on_boot=0
dfrobot_romeo_esp32s3.build.dfu_on_boot=0
dfrobot_romeo_esp32s3.build.f_cpu=240000000L
dfrobot_romeo_esp32s3.build.flash_size=16MB
dfrobot_romeo_esp32s3.build.flash_freq=80m
dfrobot_romeo_esp32s3.build.flash_mode=qio
dfrobot_romeo_esp32s3.build.boot=qio
dfrobot_romeo_esp32s3.build.boot_freq=80m
dfrobot_romeo_esp32s3.build.partitions=default
dfrobot_romeo_esp32s3.build.defines=
dfrobot_romeo_esp32s3.build.loop_core=
dfrobot_romeo_esp32s3.build.event_core=
dfrobot_romeo_esp32s3.build.flash_type=qio
dfrobot_romeo_esp32s3.build.psram_type=qspi
dfrobot_romeo_esp32s3.build.memory_type={build.flash_type}_{build.psram_type}

dfrobot_romeo_esp32s3.menu.PSRAM.opi=OPI PSRAM
dfrobot_romeo_esp32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
dfrobot_romeo_esp32s3.menu.PSRAM.opi.build.psram_type=opi
dfrobot_romeo_esp32s3.menu.PSRAM.disabled=Disabled
dfrobot_romeo_esp32s3.menu.PSRAM.disabled.build.defines=
dfrobot_romeo_esp32s3.menu.PSRAM.disabled.build.psram_type=qspi
dfrobot_romeo_esp32s3.menu.PSRAM.enabled=QSPI PSRAM
dfrobot_romeo_esp32s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
dfrobot_romeo_esp32s3.menu.PSRAM.enabled.build.psram_type=qspi


dfrobot_romeo_esp32s3.menu.FlashMode.qio=QIO 80MHz
dfrobot_romeo_esp32s3.menu.FlashMode.qio.build.flash_mode=dio
dfrobot_romeo_esp32s3.menu.FlashMode.qio.build.boot=qio
dfrobot_romeo_esp32s3.menu.FlashMode.qio.build.boot_freq=80m
dfrobot_romeo_esp32s3.menu.FlashMode.qio.build.flash_freq=80m
dfrobot_romeo_esp32s3.menu.FlashMode.qio.build.flash_type=qio
dfrobot_romeo_esp32s3.menu.FlashMode.qio120=QIO 120MHz
dfrobot_romeo_esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
dfrobot_romeo_esp32s3.menu.FlashMode.qio120.build.boot=qio
dfrobot_romeo_esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
dfrobot_romeo_esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
dfrobot_romeo_esp32s3.menu.FlashMode.qio120.build.flash_type=qio
dfrobot_romeo_esp32s3.menu.FlashMode.dio=DIO 80MHz
dfrobot_romeo_esp32s3.menu.FlashMode.dio.build.flash_mode=dio
dfrobot_romeo_esp32s3.menu.FlashMode.dio.build.boot=dio
dfrobot_romeo_esp32s3.menu.FlashMode.dio.build.boot_freq=80m
dfrobot_romeo_esp32s3.menu.FlashMode.dio.build.flash_freq=80m
dfrobot_romeo_esp32s3.menu.FlashMode.dio.build.flash_type=qio
dfrobot_romeo_esp32s3.menu.FlashMode.opi=OPI 80MHz
dfrobot_romeo_esp32s3.menu.FlashMode.opi.build.flash_mode=dout
dfrobot_romeo_esp32s3.menu.FlashMode.opi.build.boot=opi
dfrobot_romeo_esp32s3.menu.FlashMode.opi.build.boot_freq=80m
dfrobot_romeo_esp32s3.menu.FlashMode.opi.build.flash_freq=80m
dfrobot_romeo_esp32s3.menu.FlashMode.opi.build.flash_type=opi

dfrobot_romeo_esp32s3.menu.FlashSize.16M=16MB (128Mb)
dfrobot_romeo_esp32s3.menu.FlashSize.16M.build.flash_size=16MB


dfrobot_romeo_esp32s3.menu.LoopCore.1=Core 1
dfrobot_romeo_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
dfrobot_romeo_esp32s3.menu.LoopCore.0=Core 0
dfrobot_romeo_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

dfrobot_romeo_esp32s3.menu.EventsCore.1=Core 1
dfrobot_romeo_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
dfrobot_romeo_esp32s3.menu.EventsCore.0=Core 0
dfrobot_romeo_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

dfrobot_romeo_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
dfrobot_romeo_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1
dfrobot_romeo_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
dfrobot_romeo_esp32s3.menu.USBMode.default.build.usb_mode=0

dfrobot_romeo_esp32s3.menu.CDCOnBoot.cdc=Enabled
dfrobot_romeo_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
dfrobot_romeo_esp32s3.menu.CDCOnBoot.default=Disabled
dfrobot_romeo_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0


dfrobot_romeo_esp32s3.menu.MSCOnBoot.default=Disabled
dfrobot_romeo_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
dfrobot_romeo_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
dfrobot_romeo_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

dfrobot_romeo_esp32s3.menu.DFUOnBoot.default=Disabled
dfrobot_romeo_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
dfrobot_romeo_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
dfrobot_romeo_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

dfrobot_romeo_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
dfrobot_romeo_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
dfrobot_romeo_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false
dfrobot_romeo_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
dfrobot_romeo_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
dfrobot_romeo_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

dfrobot_romeo_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
dfrobot_romeo_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
dfrobot_romeo_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
dfrobot_romeo_esp32s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
dfrobot_romeo_esp32s3.menu.PartitionScheme.fatflash.build.partitions=ffat
dfrobot_romeo_esp32s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
dfrobot_romeo_esp32s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dfrobot_romeo_esp32s3.menu.PartitionScheme.minimal.build.partitions=minimal
dfrobot_romeo_esp32s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dfrobot_romeo_esp32s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
dfrobot_romeo_esp32s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dfrobot_romeo_esp32s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dfrobot_romeo_esp32s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dfrobot_romeo_esp32s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker=RainMaker
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

dfrobot_romeo_esp32s3.menu.CPUFreq.240=240MHz (WiFi)
dfrobot_romeo_esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
dfrobot_romeo_esp32s3.menu.CPUFreq.160=160MHz (WiFi)
dfrobot_romeo_esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
dfrobot_romeo_esp32s3.menu.CPUFreq.80=80MHz (WiFi)
dfrobot_romeo_esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
dfrobot_romeo_esp32s3.menu.CPUFreq.40=40MHz
dfrobot_romeo_esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
dfrobot_romeo_esp32s3.menu.CPUFreq.20=20MHz
dfrobot_romeo_esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
dfrobot_romeo_esp32s3.menu.CPUFreq.10=10MHz
dfrobot_romeo_esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

