ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio=QIO 80MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.flash_mode=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.boot=qio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.boot_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.flash_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120=QIO 120MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.boot=qio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio=DIO 80MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.flash_mode=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.boot=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.boot_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.flash_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi=OPI 80MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.flash_mode=dout
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.boot=opi
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.boot_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.flash_freq=80m

adafruit_feather_esp32s3_reversetft.menu.FlashSize.4M=4MB (32Mb)
adafruit_feather_esp32s3_reversetft.menu.FlashSize.4M.build.flash_size=4MB

adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.921600=921600
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.921600.upload.speed=921600
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.115200=115200
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.115200.upload.speed=115200
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.256000.windows=256000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.256000.upload.speed=256000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.230400=230400
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.230400.upload.speed=230400
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.460800.linux=460800
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.460800.macosx=460800
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.460800.upload.speed=460800
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.512000.windows=512000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.512000.upload.speed=512000

adafruit_feather_esp32s3_reversetft.menu.DebugLevel.none=None
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.error=Error
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.warn=Warn
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.info=Info
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.debug=Debug
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32s3_reversetft.menu.EraseFlash.none=Disabled
adafruit_feather_esp32s3_reversetft.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32s3_reversetft.menu.EraseFlash.all=Enabled
adafruit_feather_esp32s3_reversetft.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit QT Py ESP32

adafruit_qtpy_esp32_pico.name=Adafruit QT Py ESP32

adafruit_qtpy_esp32_pico.bootloader.tool=esptool_py
adafruit_qtpy_esp32_pico.bootloader.tool.default=esptool_py

adafruit_qtpy_esp32_pico.upload.tool=esptool_py
adafruit_qtpy_esp32_pico.upload.tool.default=esptool_py
adafruit_qtpy_esp32_pico.upload.tool.network=esp_ota

adafruit_qtpy_esp32_pico.upload.maximum_size=1310720
adafruit_qtpy_esp32_pico.upload.maximum_data_size=327680
adafruit_qtpy_esp32_pico.upload.flags=
adafruit_qtpy_esp32_pico.upload.extra_flags=

adafruit_qtpy_esp32_pico.serial.disableDTR=true
adafruit_qtpy_esp32_pico.serial.disableRTS=true

adafruit_qtpy_esp32_pico.build.tarch=xtensa
adafruit_qtpy_esp32_pico.build.bootloader_addr=0x1000
adafruit_qtpy_esp32_pico.build.target=esp32
adafruit_qtpy_esp32_pico.build.mcu=esp32
adafruit_qtpy_esp32_pico.build.core=esp32
adafruit_qtpy_esp32_pico.build.variant=adafruit_qtpy_esp32
adafruit_qtpy_esp32_pico.build.board=ADAFRUIT_QTPY_ESP32_PICO

adafruit_qtpy_esp32_pico.build.f_cpu=240000000L
adafruit_qtpy_esp32_pico.build.flash_size=8MB
adafruit_qtpy_esp32_pico.build.flash_freq=80m
adafruit_qtpy_esp32_pico.build.flash_mode=dio
adafruit_qtpy_esp32_pico.build.boot=dio
adafruit_qtpy_esp32_pico.build.partitions=default
adafruit_qtpy_esp32_pico.build.defines=
adafruit_qtpy_esp32_pico.build.loop_core=
adafruit_qtpy_esp32_pico.build.event_core=

adafruit_qtpy_esp32_pico.menu.LoopCore.1=Core 1
adafruit_qtpy_esp32_pico.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_qtpy_esp32_pico.menu.LoopCore.0=Core 0
adafruit_qtpy_esp32_pico.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_qtpy_esp32_pico.menu.EventsCore.1=Core 1
adafruit_qtpy_esp32_pico.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_qtpy_esp32_pico.menu.EventsCore.0=Core 0
adafruit_qtpy_esp32_pico.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_qtpy_esp32_pico.menu.PSRAM.enabled=Enabled
adafruit_qtpy_esp32_pico.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
adafruit_qtpy_esp32_pico.menu.PSRAM.disabled=Disabled
adafruit_qtpy_esp32_pico.menu.PSRAM.disabled.build.defines=

