ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
##############################################################

mhetesp32minikit.name=MH ET LIVE ESP32MiniKit

mhetesp32minikit.bootloader.tool=esptool_py
mhetesp32minikit.bootloader.tool.default=esptool_py

mhetesp32minikit.upload.tool=esptool_py
mhetesp32minikit.upload.tool.default=esptool_py
mhetesp32minikit.upload.tool.network=esp_ota

mhetesp32minikit.upload.maximum_size=1310720
mhetesp32minikit.upload.maximum_data_size=327680
mhetesp32minikit.upload.flags=
mhetesp32minikit.upload.extra_flags=

mhetesp32minikit.serial.disableDTR=true
mhetesp32minikit.serial.disableRTS=true

mhetesp32minikit.build.tarch=xtensa
mhetesp32minikit.build.bootloader_addr=0x1000
mhetesp32minikit.build.target=esp32
mhetesp32minikit.build.mcu=esp32
mhetesp32minikit.build.core=esp32
mhetesp32minikit.build.variant=mhetesp32minikit
mhetesp32minikit.build.board=MH_ET_LIVE_ESP32MINIKIT

mhetesp32minikit.build.f_cpu=240000000L
mhetesp32minikit.build.flash_mode=dio
mhetesp32minikit.build.flash_size=4MB
mhetesp32minikit.build.boot=dio
mhetesp32minikit.build.partitions=default
mhetesp32minikit.build.defines=

mhetesp32minikit.menu.FlashFreq.80=80MHz
mhetesp32minikit.menu.FlashFreq.80.build.flash_freq=80m
mhetesp32minikit.menu.FlashFreq.40=40MHz
mhetesp32minikit.menu.FlashFreq.40.build.flash_freq=40m

mhetesp32minikit.menu.PartitionScheme.default=Default with spiffs
mhetesp32minikit.menu.PartitionScheme.default.build.partitions=default
mhetesp32minikit.menu.PartitionScheme.defaultffat=Default with ffat
mhetesp32minikit.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
mhetesp32minikit.menu.PartitionScheme.no_ota=No OTA (Large APP)
mhetesp32minikit.menu.PartitionScheme.no_ota.build.partitions=no_ota
mhetesp32minikit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
mhetesp32minikit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
mhetesp32minikit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
mhetesp32minikit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

mhetesp32minikit.menu.UploadSpeed.921600=921600
mhetesp32minikit.menu.UploadSpeed.921600.upload.speed=921600
mhetesp32minikit.menu.UploadSpeed.115200=115200
mhetesp32minikit.menu.UploadSpeed.115200.upload.speed=115200
mhetesp32minikit.menu.UploadSpeed.256000.windows=256000
mhetesp32minikit.menu.UploadSpeed.256000.upload.speed=256000
mhetesp32minikit.menu.UploadSpeed.230400.windows.upload.speed=256000
mhetesp32minikit.menu.UploadSpeed.230400=230400
mhetesp32minikit.menu.UploadSpeed.230400.upload.speed=230400
mhetesp32minikit.menu.UploadSpeed.460800.linux=460800
mhetesp32minikit.menu.UploadSpeed.460800.macosx=460800
mhetesp32minikit.menu.UploadSpeed.460800.upload.speed=460800
mhetesp32minikit.menu.UploadSpeed.512000.windows=512000
mhetesp32minikit.menu.UploadSpeed.512000.upload.speed=512000

mhetesp32minikit.menu.DebugLevel.none=None
mhetesp32minikit.menu.DebugLevel.none.build.code_debug=0
mhetesp32minikit.menu.DebugLevel.error=Error
mhetesp32minikit.menu.DebugLevel.error.build.code_debug=1
mhetesp32minikit.menu.DebugLevel.warn=Warn
mhetesp32minikit.menu.DebugLevel.warn.build.code_debug=2
mhetesp32minikit.menu.DebugLevel.info=Info
mhetesp32minikit.menu.DebugLevel.info.build.code_debug=3
mhetesp32minikit.menu.DebugLevel.debug=Debug
mhetesp32minikit.menu.DebugLevel.debug.build.code_debug=4
mhetesp32minikit.menu.DebugLevel.verbose=Verbose
mhetesp32minikit.menu.DebugLevel.verbose.build.code_debug=5

mhetesp32minikit.menu.EraseFlash.none=Disabled
mhetesp32minikit.menu.EraseFlash.none.upload.erase_cmd=
mhetesp32minikit.menu.EraseFlash.all=Enabled
mhetesp32minikit.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32vn-iot-uno.name=ESP32vn IoT Uno

esp32vn-iot-uno.bootloader.tool=esptool_py
esp32vn-iot-uno.bootloader.tool.default=esptool_py

esp32vn-iot-uno.upload.tool=esptool_py
esp32vn-iot-uno.upload.tool.default=esptool_py
esp32vn-iot-uno.upload.tool.network=esp_ota

esp32vn-iot-uno.upload.maximum_size=1310720
esp32vn-iot-uno.upload.maximum_data_size=327680
esp32vn-iot-uno.upload.flags=
esp32vn-iot-uno.upload.extra_flags=

esp32vn-iot-uno.serial.disableDTR=true
esp32vn-iot-uno.serial.disableRTS=true

esp32vn-iot-uno.build.tarch=xtensa
esp32vn-iot-uno.build.bootloader_addr=0x1000
esp32vn-iot-uno.build.target=esp32
esp32vn-iot-uno.build.mcu=esp32
esp32vn-iot-uno.build.core=esp32
esp32vn-iot-uno.build.variant=esp32vn-iot-uno
esp32vn-iot-uno.build.board=esp32vn_iot_uno

esp32vn-iot-uno.build.f_cpu=240000000L
esp32vn-iot-uno.build.flash_mode=dio
esp32vn-iot-uno.build.flash_size=4MB
esp32vn-iot-uno.build.boot=dio
esp32vn-iot-uno.build.partitions=default
esp32vn-iot-uno.build.defines=

esp32vn-iot-uno.menu.FlashFreq.80=80MHz
esp32vn-iot-uno.menu.FlashFreq.80.build.flash_freq=80m
esp32vn-iot-uno.menu.FlashFreq.40=40MHz
esp32vn-iot-uno.menu.FlashFreq.40.build.flash_freq=40m

esp32vn-iot-uno.menu.UploadSpeed.921600=921600
esp32vn-iot-uno.menu.UploadSpeed.921600.upload.speed=921600
esp32vn-iot-uno.menu.UploadSpeed.115200=115200
esp32vn-iot-uno.menu.UploadSpeed.115200.upload.speed=115200
esp32vn-iot-uno.menu.UploadSpeed.256000.windows=256000
esp32vn-iot-uno.menu.UploadSpeed.256000.upload.speed=256000
esp32vn-iot-uno.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32vn-iot-uno.menu.UploadSpeed.230400=230400
esp32vn-iot-uno.menu.UploadSpeed.230400.upload.speed=230400
esp32vn-iot-uno.menu.UploadSpeed.460800.linux=460800
esp32vn-iot-uno.menu.UploadSpeed.460800.macosx=460800
esp32vn-iot-uno.menu.UploadSpeed.460800.upload.speed=460800
esp32vn-iot-uno.menu.UploadSpeed.512000.windows=512000
esp32vn-iot-uno.menu.UploadSpeed.512000.upload.speed=512000

esp32vn-iot-uno.menu.DebugLevel.none=None
esp32vn-iot-uno.menu.DebugLevel.none.build.code_debug=0
esp32vn-iot-uno.menu.DebugLevel.error=Error
esp32vn-iot-uno.menu.DebugLevel.error.build.code_debug=1
esp32vn-iot-uno.menu.DebugLevel.warn=Warn
esp32vn-iot-uno.menu.DebugLevel.warn.build.code_debug=2
esp32vn-iot-uno.menu.DebugLevel.info=Info
esp32vn-iot-uno.menu.DebugLevel.info.build.code_debug=3
esp32vn-iot-uno.menu.DebugLevel.debug=Debug
esp32vn-iot-uno.menu.DebugLevel.debug.build.code_debug=4
esp32vn-iot-uno.menu.DebugLevel.verbose=Verbose
esp32vn-iot-uno.menu.DebugLevel.verbose.build.code_debug=5

esp32vn-iot-uno.menu.EraseFlash.none=Disabled
esp32vn-iot-uno.menu.EraseFlash.none.upload.erase_cmd=
esp32vn-iot-uno.menu.EraseFlash.all=Enabled
esp32vn-iot-uno.menu.EraseFlash.all.upload.erase_cmd=-e

