ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
m5stack-coreink.menu.PartitionScheme.default=Default
m5stack-coreink.menu.PartitionScheme.default.build.partitions=default
m5stack-coreink.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stack-coreink.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-coreink.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack-coreink.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stack-coreink.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-coreink.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-coreink.menu.UploadSpeed.921600=921600
m5stack-coreink.menu.UploadSpeed.921600.upload.speed=921600
m5stack-coreink.menu.UploadSpeed.115200=115200
m5stack-coreink.menu.UploadSpeed.115200.upload.speed=115200
m5stack-coreink.menu.UploadSpeed.256000.windows=256000
m5stack-coreink.menu.UploadSpeed.256000.upload.speed=256000
m5stack-coreink.menu.UploadSpeed.230400.windows.upload.speed=256000
m5stack-coreink.menu.UploadSpeed.230400=230400
m5stack-coreink.menu.UploadSpeed.230400.upload.speed=230400
m5stack-coreink.menu.UploadSpeed.460800.linux=460800
m5stack-coreink.menu.UploadSpeed.460800.macosx=460800
m5stack-coreink.menu.UploadSpeed.460800.upload.speed=460800
m5stack-coreink.menu.UploadSpeed.512000.windows=512000
m5stack-coreink.menu.UploadSpeed.512000.upload.speed=512000
m5stack-coreink.menu.UploadSpeed.1500000=1500000
m5stack-coreink.menu.UploadSpeed.1500000.upload.speed=1500000

m5stack-coreink.menu.DebugLevel.none=None
m5stack-coreink.menu.DebugLevel.none.build.code_debug=0
m5stack-coreink.menu.DebugLevel.error=Error
m5stack-coreink.menu.DebugLevel.error.build.code_debug=1
m5stack-coreink.menu.DebugLevel.warn=Warn
m5stack-coreink.menu.DebugLevel.warn.build.code_debug=2
m5stack-coreink.menu.DebugLevel.info=Info
m5stack-coreink.menu.DebugLevel.info.build.code_debug=3
m5stack-coreink.menu.DebugLevel.debug=Debug
m5stack-coreink.menu.DebugLevel.debug.build.code_debug=4
m5stack-coreink.menu.DebugLevel.verbose=Verbose
m5stack-coreink.menu.DebugLevel.verbose.build.code_debug=5

m5stack-coreink.menu.EraseFlash.none=Disabled
m5stack-coreink.menu.EraseFlash.none.upload.erase_cmd=
m5stack-coreink.menu.EraseFlash.all=Enabled
m5stack-coreink.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

stamp-s3.name=STAMP-S3
stamp-s3.vid.0=0x303a
stamp-s3.pid.0=0x1001

stamp-s3.bootloader.tool=esptool_py
stamp-s3.bootloader.tool.default=esptool_py

stamp-s3.upload.tool=esptool_py
stamp-s3.upload.tool.default=esptool_py
stamp-s3.upload.tool.network=esp_ota

stamp-s3.upload.maximum_size=1310720
stamp-s3.upload.maximum_data_size=327680
stamp-s3.upload.flags=
stamp-s3.upload.extra_flags=
stamp-s3.upload.use_1200bps_touch=false
stamp-s3.upload.wait_for_upload_port=false

stamp-s3.serial.disableDTR=false
stamp-s3.serial.disableRTS=false

stamp-s3.build.tarch=xtensa
stamp-s3.build.bootloader_addr=0x0
stamp-s3.build.target=esp32s3
stamp-s3.build.mcu=esp32s3
stamp-s3.build.core=esp32
stamp-s3.build.variant=m5stack_stamp_s3
stamp-s3.build.board=STAMP_S3

stamp-s3.build.usb_mode=1
stamp-s3.build.cdc_on_boot=0
stamp-s3.build.msc_on_boot=0
stamp-s3.build.dfu_on_boot=0
stamp-s3.build.f_cpu=240000000L
stamp-s3.build.flash_size=4MB
stamp-s3.build.flash_freq=80m
stamp-s3.build.flash_mode=dio
stamp-s3.build.boot=qio
stamp-s3.build.boot_freq=80m
stamp-s3.build.partitions=default
stamp-s3.build.defines=
stamp-s3.build.loop_core=
stamp-s3.build.event_core=
stamp-s3.build.psram_type=qspi
stamp-s3.build.memory_type={build.boot}_{build.psram_type}

stamp-s3.menu.JTAGAdapter.default=Disabled
stamp-s3.menu.JTAGAdapter.default.build.copy_jtag_files=0
stamp-s3.menu.JTAGAdapter.builtin=Integrated USB JTAG
stamp-s3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
stamp-s3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
stamp-s3.menu.JTAGAdapter.external=FTDI Adapter
stamp-s3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
stamp-s3.menu.JTAGAdapter.external.build.copy_jtag_files=1
stamp-s3.menu.JTAGAdapter.bridge=ESP USB Bridge
stamp-s3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
stamp-s3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

stamp-s3.menu.PSRAM.disabled=Disabled
stamp-s3.menu.PSRAM.disabled.build.defines=
stamp-s3.menu.PSRAM.disabled.build.psram_type=qspi
stamp-s3.menu.PSRAM.enabled=QSPI PSRAM
stamp-s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
stamp-s3.menu.PSRAM.enabled.build.psram_type=qspi
stamp-s3.menu.PSRAM.opi=OPI PSRAM
stamp-s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
stamp-s3.menu.PSRAM.opi.build.psram_type=opi

stamp-s3.menu.FlashMode.qio=QIO 80MHz
stamp-s3.menu.FlashMode.qio.build.flash_mode=dio
stamp-s3.menu.FlashMode.qio.build.boot=qio
stamp-s3.menu.FlashMode.qio.build.boot_freq=80m
stamp-s3.menu.FlashMode.qio.build.flash_freq=80m
stamp-s3.menu.FlashMode.qio120=QIO 120MHz
stamp-s3.menu.FlashMode.qio120.build.flash_mode=dio
stamp-s3.menu.FlashMode.qio120.build.boot=qio
stamp-s3.menu.FlashMode.qio120.build.boot_freq=120m
stamp-s3.menu.FlashMode.qio120.build.flash_freq=80m
stamp-s3.menu.FlashMode.dio=DIO 80MHz
stamp-s3.menu.FlashMode.dio.build.flash_mode=dio
stamp-s3.menu.FlashMode.dio.build.boot=dio
stamp-s3.menu.FlashMode.dio.build.boot_freq=80m
stamp-s3.menu.FlashMode.dio.build.flash_freq=80m
stamp-s3.menu.FlashMode.opi=OPI 80MHz
stamp-s3.menu.FlashMode.opi.build.flash_mode=dout
stamp-s3.menu.FlashMode.opi.build.boot=opi
stamp-s3.menu.FlashMode.opi.build.boot_freq=80m
stamp-s3.menu.FlashMode.opi.build.flash_freq=80m

stamp-s3.menu.FlashSize.4M=4MB (32Mb)
stamp-s3.menu.FlashSize.4M.build.flash_size=4MB
stamp-s3.menu.FlashSize.8M=8MB (64Mb)
stamp-s3.menu.FlashSize.8M.build.flash_size=8MB
stamp-s3.menu.FlashSize.8M.build.partitions=default_8MB
stamp-s3.menu.FlashSize.16M=16MB (128Mb)
stamp-s3.menu.FlashSize.16M.build.flash_size=16MB
#stamp-s3.menu.FlashSize.32M=32MB (256Mb)
#stamp-s3.menu.FlashSize.32M.build.flash_size=32MB

stamp-s3.menu.LoopCore.1=Core 1
stamp-s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
stamp-s3.menu.LoopCore.0=Core 0
stamp-s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

stamp-s3.menu.EventsCore.1=Core 1
stamp-s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
stamp-s3.menu.EventsCore.0=Core 0
stamp-s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

stamp-s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
stamp-s3.menu.USBMode.hwcdc.build.usb_mode=1
stamp-s3.menu.USBMode.default=USB-OTG (TinyUSB)
stamp-s3.menu.USBMode.default.build.usb_mode=0

