ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
stamp-s3.menu.CDCOnBoot.default=Disabled
stamp-s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
stamp-s3.menu.CDCOnBoot.cdc=Enabled
stamp-s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

stamp-s3.menu.MSCOnBoot.default=Disabled
stamp-s3.menu.MSCOnBoot.default.build.msc_on_boot=0
stamp-s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
stamp-s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

stamp-s3.menu.DFUOnBoot.default=Disabled
stamp-s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
stamp-s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
stamp-s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

stamp-s3.menu.UploadMode.default=UART0 / Hardware CDC
stamp-s3.menu.UploadMode.default.upload.use_1200bps_touch=false
stamp-s3.menu.UploadMode.default.upload.wait_for_upload_port=false
stamp-s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
stamp-s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
stamp-s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

stamp-s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
stamp-s3.menu.PartitionScheme.default.build.partitions=default
stamp-s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
stamp-s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
stamp-s3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
stamp-s3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
stamp-s3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

stamp-s3.menu.CPUFreq.240=240MHz (WiFi)
stamp-s3.menu.CPUFreq.240.build.f_cpu=240000000L
stamp-s3.menu.CPUFreq.160=160MHz (WiFi)
stamp-s3.menu.CPUFreq.160.build.f_cpu=160000000L
stamp-s3.menu.CPUFreq.80=80MHz (WiFi)
stamp-s3.menu.CPUFreq.80.build.f_cpu=80000000L
stamp-s3.menu.CPUFreq.40=40MHz
stamp-s3.menu.CPUFreq.40.build.f_cpu=40000000L
stamp-s3.menu.CPUFreq.20=20MHz
stamp-s3.menu.CPUFreq.20.build.f_cpu=20000000L
stamp-s3.menu.CPUFreq.10=10MHz
stamp-s3.menu.CPUFreq.10.build.f_cpu=10000000L

stamp-s3.menu.UploadSpeed.921600=921600
stamp-s3.menu.UploadSpeed.921600.upload.speed=921600
stamp-s3.menu.UploadSpeed.115200=115200
stamp-s3.menu.UploadSpeed.115200.upload.speed=115200
stamp-s3.menu.UploadSpeed.256000.windows=256000
stamp-s3.menu.UploadSpeed.256000.upload.speed=256000
stamp-s3.menu.UploadSpeed.230400.windows.upload.speed=256000
stamp-s3.menu.UploadSpeed.230400=230400
stamp-s3.menu.UploadSpeed.230400.upload.speed=230400
stamp-s3.menu.UploadSpeed.460800.linux=460800
stamp-s3.menu.UploadSpeed.460800.macosx=460800
stamp-s3.menu.UploadSpeed.460800.upload.speed=460800
stamp-s3.menu.UploadSpeed.512000.windows=512000
stamp-s3.menu.UploadSpeed.512000.upload.speed=512000

stamp-s3.menu.DebugLevel.none=None
stamp-s3.menu.DebugLevel.none.build.code_debug=0
stamp-s3.menu.DebugLevel.error=Error
stamp-s3.menu.DebugLevel.error.build.code_debug=1
stamp-s3.menu.DebugLevel.warn=Warn
stamp-s3.menu.DebugLevel.warn.build.code_debug=2
stamp-s3.menu.DebugLevel.info=Info
stamp-s3.menu.DebugLevel.info.build.code_debug=3
stamp-s3.menu.DebugLevel.debug=Debug
stamp-s3.menu.DebugLevel.debug.build.code_debug=4
stamp-s3.menu.DebugLevel.verbose=Verbose
stamp-s3.menu.DebugLevel.verbose.build.code_debug=5

stamp-s3.menu.EraseFlash.none=Disabled
stamp-s3.menu.EraseFlash.none.upload.erase_cmd=
stamp-s3.menu.EraseFlash.all=Enabled
stamp-s3.menu.EraseFlash.all.upload.erase_cmd=-e

###############################################################

m5stamp-pico.name=M5Stamp-Pico

m5stamp-pico.bootloader.tool=esptool_py
m5stamp-pico.bootloader.tool.default=esptool_py

m5stamp-pico.upload.tool=esptool_py
m5stamp-pico.upload.tool.default=esptool_py
m5stamp-pico.upload.tool.network=esp_ota

m5stamp-pico.upload.maximum_size=1310720
m5stamp-pico.upload.maximum_data_size=327680
m5stamp-pico.upload.wait_for_upload_port=true
m5stamp-pico.upload.flags=
m5stamp-pico.upload.extra_flags=

m5stamp-pico.serial.disableDTR=true
m5stamp-pico.serial.disableRTS=true

m5stamp-pico.build.tarch=xtensa
m5stamp-pico.build.bootloader_addr=0x1000
m5stamp-pico.build.target=esp32
m5stamp-pico.build.mcu=esp32
m5stamp-pico.build.core=esp32
m5stamp-pico.build.variant=m5stack_stamp_pico
m5stamp-pico.build.board=M5Stamp_Pico

m5stamp-pico.build.f_cpu=240000000L
m5stamp-pico.build.flash_size=4MB
m5stamp-pico.build.flash_freq=80m
m5stamp-pico.build.flash_mode=dio
m5stamp-pico.build.boot=dio
m5stamp-pico.build.partitions=default
m5stamp-pico.build.defines=

m5stamp-pico.menu.PartitionScheme.default=Default
m5stamp-pico.menu.PartitionScheme.default.build.partitions=default
m5stamp-pico.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stamp-pico.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stamp-pico.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stamp-pico.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stamp-pico.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stamp-pico.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080


m5stamp-pico.menu.UploadSpeed.1500000=1500000
m5stamp-pico.menu.UploadSpeed.1500000.upload.speed=1500000
m5stamp-pico.menu.UploadSpeed.750000=750000
m5stamp-pico.menu.UploadSpeed.750000.upload.speed=750000
m5stamp-pico.menu.UploadSpeed.500000=500000
m5stamp-pico.menu.UploadSpeed.500000.upload.speed=500000
m5stamp-pico.menu.UploadSpeed.250000=250000
m5stamp-pico.menu.UploadSpeed.250000.upload.speed=250000
m5stamp-pico.menu.UploadSpeed.115200=115200
m5stamp-pico.menu.UploadSpeed.115200.upload.speed=115200

m5stamp-pico.menu.DebugLevel.none=None
m5stamp-pico.menu.DebugLevel.none.build.code_debug=0
m5stamp-pico.menu.DebugLevel.error=Error
m5stamp-pico.menu.DebugLevel.error.build.code_debug=1
m5stamp-pico.menu.DebugLevel.warn=Warn
m5stamp-pico.menu.DebugLevel.warn.build.code_debug=2
m5stamp-pico.menu.DebugLevel.info=Info
m5stamp-pico.menu.DebugLevel.info.build.code_debug=3
m5stamp-pico.menu.DebugLevel.debug=Debug
m5stamp-pico.menu.DebugLevel.debug.build.code_debug=4
m5stamp-pico.menu.DebugLevel.verbose=Verbose
m5stamp-pico.menu.DebugLevel.verbose.build.code_debug=5

