ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
espectro32.menu.FlashSize.4M=4MB (32Mb)
espectro32.menu.FlashSize.4M.build.flash_size=4MB
espectro32.menu.FlashSize.2M=2MB (16Mb)
espectro32.menu.FlashSize.2M.build.flash_size=2MB
espectro32.menu.FlashSize.2M.build.partitions=minimal

espectro32.menu.UploadSpeed.921600=921600
espectro32.menu.UploadSpeed.921600.upload.speed=921600
espectro32.menu.UploadSpeed.115200=115200
espectro32.menu.UploadSpeed.115200.upload.speed=115200
espectro32.menu.UploadSpeed.256000.windows=256000
espectro32.menu.UploadSpeed.256000.upload.speed=256000
espectro32.menu.UploadSpeed.230400.windows.upload.speed=256000
espectro32.menu.UploadSpeed.230400=230400
espectro32.menu.UploadSpeed.230400.upload.speed=230400
espectro32.menu.UploadSpeed.460800.linux=460800
espectro32.menu.UploadSpeed.460800.macosx=460800
espectro32.menu.UploadSpeed.460800.upload.speed=460800
espectro32.menu.UploadSpeed.512000.windows=512000
espectro32.menu.UploadSpeed.512000.upload.speed=512000

espectro32.menu.DebugLevel.none=None
espectro32.menu.DebugLevel.none.build.code_debug=0
espectro32.menu.DebugLevel.error=Error
espectro32.menu.DebugLevel.error.build.code_debug=1
espectro32.menu.DebugLevel.warn=Warn
espectro32.menu.DebugLevel.warn.build.code_debug=2
espectro32.menu.DebugLevel.info=Info
espectro32.menu.DebugLevel.info.build.code_debug=3
espectro32.menu.DebugLevel.debug=Debug
espectro32.menu.DebugLevel.debug.build.code_debug=4
espectro32.menu.DebugLevel.verbose=Verbose
espectro32.menu.DebugLevel.verbose.build.code_debug=5

espectro32.menu.EraseFlash.none=Disabled
espectro32.menu.EraseFlash.none.upload.erase_cmd=
espectro32.menu.EraseFlash.all=Enabled
espectro32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

CoreESP32.name=Microduino-CoreESP32

CoreESP32.bootloader.tool=esptool_py
CoreESP32.bootloader.tool.default=esptool_py

CoreESP32.upload.tool=esptool_py
CoreESP32.upload.tool.default=esptool_py
CoreESP32.upload.tool.network=esp_ota

CoreESP32.upload.maximum_size=1310720
CoreESP32.upload.maximum_data_size=327680
CoreESP32.upload.flags=
CoreESP32.upload.extra_flags=

CoreESP32.serial.disableDTR=false
CoreESP32.serial.disableRTS=false

CoreESP32.build.tarch=xtensa
CoreESP32.build.bootloader_addr=0x1000
CoreESP32.build.target=esp32
CoreESP32.build.mcu=esp32
CoreESP32.build.core=esp32
CoreESP32.build.variant=Microduino-esp32
CoreESP32.build.board=CoreESP32

CoreESP32.build.f_cpu=240000000L
CoreESP32.build.flash_mode=dio
CoreESP32.build.flash_size=4MB
CoreESP32.build.boot=dio
CoreESP32.build.partitions=default
CoreESP32.build.defines=

CoreESP32.menu.PSRAM.disabled=Disabled
CoreESP32.menu.PSRAM.disabled.build.defines=
CoreESP32.menu.PSRAM.disabled.build.extra_libs=
CoreESP32.menu.PSRAM.enabled=Enabled
CoreESP32.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
CoreESP32.menu.PSRAM.enabled.build.extra_libs=

CoreESP32.menu.PartitionScheme.default=Default
CoreESP32.menu.PartitionScheme.default.build.partitions=default
CoreESP32.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
CoreESP32.menu.PartitionScheme.minimal.build.partitions=minimal
CoreESP32.menu.PartitionScheme.no_ota=No OTA (Large APP)
CoreESP32.menu.PartitionScheme.no_ota.build.partitions=no_ota
CoreESP32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
CoreESP32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
CoreESP32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
CoreESP32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
CoreESP32.menu.PartitionScheme.fatflash=16M Fat
CoreESP32.menu.PartitionScheme.fatflash.build.partitions=ffat

CoreESP32.menu.FlashFreq.80=80MHz
CoreESP32.menu.FlashFreq.80.build.flash_freq=80m
CoreESP32.menu.FlashFreq.40=40MHz
CoreESP32.menu.FlashFreq.40.build.flash_freq=40m

CoreESP32.menu.UploadSpeed.921600=921600
CoreESP32.menu.UploadSpeed.921600.upload.speed=921600
CoreESP32.menu.UploadSpeed.115200=115200
CoreESP32.menu.UploadSpeed.115200.upload.speed=115200
CoreESP32.menu.UploadSpeed.256000.windows=256000
CoreESP32.menu.UploadSpeed.256000.upload.speed=256000
CoreESP32.menu.UploadSpeed.230400.windows.upload.speed=256000
CoreESP32.menu.UploadSpeed.230400=230400
CoreESP32.menu.UploadSpeed.230400.upload.speed=230400
CoreESP32.menu.UploadSpeed.460800.linux=460800
CoreESP32.menu.UploadSpeed.460800.macosx=460800
CoreESP32.menu.UploadSpeed.460800.upload.speed=460800
CoreESP32.menu.UploadSpeed.512000.windows=512000
CoreESP32.menu.UploadSpeed.512000.upload.speed=512000

CoreESP32.menu.DebugLevel.none=None
CoreESP32.menu.DebugLevel.none.build.code_debug=0
CoreESP32.menu.DebugLevel.error=Error
CoreESP32.menu.DebugLevel.error.build.code_debug=1
CoreESP32.menu.DebugLevel.warn=Warn
CoreESP32.menu.DebugLevel.warn.build.code_debug=2
CoreESP32.menu.DebugLevel.info=Info
CoreESP32.menu.DebugLevel.info.build.code_debug=3
CoreESP32.menu.DebugLevel.debug=Debug
CoreESP32.menu.DebugLevel.debug.build.code_debug=4
CoreESP32.menu.DebugLevel.verbose=Verbose
CoreESP32.menu.DebugLevel.verbose.build.code_debug=5

CoreESP32.menu.EraseFlash.none=Disabled
CoreESP32.menu.EraseFlash.none.upload.erase_cmd=
CoreESP32.menu.EraseFlash.all=Enabled
CoreESP32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

alksesp32.name=ALKS ESP32

alksesp32.bootloader.tool=esptool_py
alksesp32.bootloader.tool.default=esptool_py

alksesp32.upload.tool=esptool_py
alksesp32.upload.tool.default=esptool_py
alksesp32.upload.tool.network=esp_ota

alksesp32.upload.maximum_size=1310720
alksesp32.upload.maximum_data_size=327680
alksesp32.upload.flags=
alksesp32.upload.extra_flags=

alksesp32.serial.disableDTR=true
alksesp32.serial.disableRTS=true

alksesp32.build.tarch=xtensa
alksesp32.build.bootloader_addr=0x1000
alksesp32.build.target=esp32
alksesp32.build.mcu=esp32
alksesp32.build.core=esp32
alksesp32.build.variant=alksesp32
alksesp32.build.board=ALKS

alksesp32.build.f_cpu=240000000L
alksesp32.build.flash_size=4MB
alksesp32.build.flash_freq=40m
alksesp32.build.flash_mode=dio
alksesp32.build.boot=dio
alksesp32.build.partitions=default
alksesp32.build.defines=

alksesp32.menu.PSRAM.disabled=Disabled
alksesp32.menu.PSRAM.disabled.build.defines=
alksesp32.menu.PSRAM.disabled.build.extra_libs=
alksesp32.menu.PSRAM.enabled=Enabled
alksesp32.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
alksesp32.menu.PSRAM.enabled.build.extra_libs=

alksesp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
alksesp32.menu.PartitionScheme.default.build.partitions=default
alksesp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
alksesp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
alksesp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
alksesp32.menu.PartitionScheme.minimal.build.partitions=minimal
alksesp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
alksesp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
alksesp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
alksesp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
alksesp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
alksesp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
alksesp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
alksesp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
alksesp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
alksesp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
alksesp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
alksesp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
alksesp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
alksesp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
alksesp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
alksesp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
alksesp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
alksesp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
alksesp32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
alksesp32.menu.PartitionScheme.fatflash.build.partitions=ffat

alksesp32.menu.CPUFreq.240=240MHz (WiFi/BT)
alksesp32.menu.CPUFreq.240.build.f_cpu=240000000L
alksesp32.menu.CPUFreq.160=160MHz (WiFi/BT)
alksesp32.menu.CPUFreq.160.build.f_cpu=160000000L
alksesp32.menu.CPUFreq.80=80MHz (WiFi/BT)
alksesp32.menu.CPUFreq.80.build.f_cpu=80000000L
alksesp32.menu.CPUFreq.40=40MHz (40MHz XTAL)
alksesp32.menu.CPUFreq.40.build.f_cpu=40000000L
alksesp32.menu.CPUFreq.26=26MHz (26MHz XTAL)
alksesp32.menu.CPUFreq.26.build.f_cpu=26000000L
alksesp32.menu.CPUFreq.20=20MHz (40MHz XTAL)
alksesp32.menu.CPUFreq.20.build.f_cpu=20000000L
alksesp32.menu.CPUFreq.13=13MHz (26MHz XTAL)
alksesp32.menu.CPUFreq.13.build.f_cpu=13000000L
alksesp32.menu.CPUFreq.10=10MHz (40MHz XTAL)
alksesp32.menu.CPUFreq.10.build.f_cpu=10000000L

