ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
alksesp32.menu.FlashMode.qio=QIO
alksesp32.menu.FlashMode.qio.build.flash_mode=dio
alksesp32.menu.FlashMode.qio.build.boot=qio
alksesp32.menu.FlashMode.dio=DIO
alksesp32.menu.FlashMode.dio.build.flash_mode=dio
alksesp32.menu.FlashMode.dio.build.boot=dio
alksesp32.menu.FlashMode.qout=QOUT
alksesp32.menu.FlashMode.qout.build.flash_mode=dout
alksesp32.menu.FlashMode.qout.build.boot=qout
alksesp32.menu.FlashMode.dout=DOUT
alksesp32.menu.FlashMode.dout.build.flash_mode=dout
alksesp32.menu.FlashMode.dout.build.boot=dout

alksesp32.menu.FlashFreq.80=80MHz
alksesp32.menu.FlashFreq.80.build.flash_freq=80m
alksesp32.menu.FlashFreq.40=40MHz
alksesp32.menu.FlashFreq.40.build.flash_freq=40m

alksesp32.menu.FlashSize.4M=4MB (32Mb)
alksesp32.menu.FlashSize.4M.build.flash_size=4MB
alksesp32.menu.FlashSize.2M=2MB (16Mb)
alksesp32.menu.FlashSize.2M.build.flash_size=2MB
alksesp32.menu.FlashSize.2M.build.partitions=minimal
alksesp32.menu.FlashSize.16M=16MB (128Mb)
alksesp32.menu.FlashSize.16M.build.flash_size=16MB
alksesp32.menu.FlashSize.16M.build.partitions=ffat

alksesp32.menu.UploadSpeed.921600=921600
alksesp32.menu.UploadSpeed.921600.upload.speed=921600
alksesp32.menu.UploadSpeed.115200=115200
alksesp32.menu.UploadSpeed.115200.upload.speed=115200
alksesp32.menu.UploadSpeed.256000.windows=256000
alksesp32.menu.UploadSpeed.256000.upload.speed=256000
alksesp32.menu.UploadSpeed.230400.windows.upload.speed=256000
alksesp32.menu.UploadSpeed.230400=230400
alksesp32.menu.UploadSpeed.230400.upload.speed=230400
alksesp32.menu.UploadSpeed.460800.linux=460800
alksesp32.menu.UploadSpeed.460800.macosx=460800
alksesp32.menu.UploadSpeed.460800.upload.speed=460800
alksesp32.menu.UploadSpeed.512000.windows=512000
alksesp32.menu.UploadSpeed.512000.upload.speed=512000

alksesp32.menu.DebugLevel.none=None
alksesp32.menu.DebugLevel.none.build.code_debug=0
alksesp32.menu.DebugLevel.error=Error
alksesp32.menu.DebugLevel.error.build.code_debug=1
alksesp32.menu.DebugLevel.warn=Warn
alksesp32.menu.DebugLevel.warn.build.code_debug=2
alksesp32.menu.DebugLevel.info=Info
alksesp32.menu.DebugLevel.info.build.code_debug=3
alksesp32.menu.DebugLevel.debug=Debug
alksesp32.menu.DebugLevel.debug.build.code_debug=4
alksesp32.menu.DebugLevel.verbose=Verbose
alksesp32.menu.DebugLevel.verbose.build.code_debug=5

alksesp32.menu.EraseFlash.none=Disabled
alksesp32.menu.EraseFlash.none.upload.erase_cmd=
alksesp32.menu.EraseFlash.all=Enabled
alksesp32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

wipy3.name=WiPy 3.0

wipy3.bootloader.tool=esptool_py
wipy3.bootloader.tool.default=esptool_py

wipy3.upload.tool=esptool_py
wipy3.upload.tool.default=esptool_py
wipy3.upload.tool.network=esp_ota

wipy3.upload.maximum_size=1310720
wipy3.upload.maximum_data_size=294912
wipy3.upload.flags=
wipy3.upload.extra_flags=

wipy3.serial.disableDTR=true
wipy3.serial.disableRTS=true

wipy3.build.tarch=xtensa
wipy3.build.bootloader_addr=0x1000
wipy3.build.target=esp32
wipy3.build.mcu=esp32
wipy3.build.core=esp32
wipy3.build.variant=wipy3
wipy3.build.board=WIPY3

wipy3.build.f_cpu=240000000L
wipy3.build.flash_mode=dio
wipy3.build.flash_size=8MB
wipy3.build.boot=dio
wipy3.build.partitions=default
wipy3.build.defines=

wipy3.menu.FlashFreq.80=80MHz
wipy3.menu.FlashFreq.80.build.flash_freq=80m
wipy3.menu.FlashFreq.40=40MHz
wipy3.menu.FlashFreq.40.build.flash_freq=40m

wipy3.menu.UploadSpeed.921600=921600
wipy3.menu.UploadSpeed.921600.upload.speed=921600
wipy3.menu.UploadSpeed.115200=115200
wipy3.menu.UploadSpeed.115200.upload.speed=115200
wipy3.menu.UploadSpeed.256000.windows=256000
wipy3.menu.UploadSpeed.256000.upload.speed=256000
wipy3.menu.UploadSpeed.230400.windows.upload.speed=256000
wipy3.menu.UploadSpeed.230400=230400
wipy3.menu.UploadSpeed.230400.upload.speed=230400
wipy3.menu.UploadSpeed.460800.linux=460800
wipy3.menu.UploadSpeed.460800.macosx=460800
wipy3.menu.UploadSpeed.460800.upload.speed=460800
wipy3.menu.UploadSpeed.512000.windows=512000
wipy3.menu.UploadSpeed.512000.upload.speed=512000

wipy3.menu.DebugLevel.none=None
wipy3.menu.DebugLevel.none.build.code_debug=0
wipy3.menu.DebugLevel.error=Error
wipy3.menu.DebugLevel.error.build.code_debug=1
wipy3.menu.DebugLevel.warn=Warn
wipy3.menu.DebugLevel.warn.build.code_debug=2
wipy3.menu.DebugLevel.info=Info
wipy3.menu.DebugLevel.info.build.code_debug=3
wipy3.menu.DebugLevel.debug=Debug
wipy3.menu.DebugLevel.debug.build.code_debug=4
wipy3.menu.DebugLevel.verbose=Verbose
wipy3.menu.DebugLevel.verbose.build.code_debug=5

wipy3.menu.EraseFlash.none=Disabled
wipy3.menu.EraseFlash.none.upload.erase_cmd=
wipy3.menu.EraseFlash.all=Enabled
wipy3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

wt32-eth01.name=WT32-ETH01 Ethernet Module

wt32-eth01.bootloader.tool=esptool_py
wt32-eth01.bootloader.tool.default=esptool_py

wt32-eth01.upload.tool=esptool_py
wt32-eth01.upload.tool.default=esptool_py
wt32-eth01.upload.tool.network=esp_ota

wt32-eth01.upload.maximum_size=8388608
wt32-eth01.upload.maximum_data_size=327680
wt32-eth01.upload.flags=
wt32-eth01.upload.extra_flags=

wt32-eth01.serial.disableDTR=true
wt32-eth01.serial.disableRTS=true

wt32-eth01.build.tarch=xtensa
wt32-eth01.build.bootloader_addr=0x1000
wt32-eth01.build.target=esp32
wt32-eth01.build.mcu=esp32
wt32-eth01.build.core=esp32
wt32-eth01.build.variant=wt32-eth01
wt32-eth01.build.board=WT32_ETH01

wt32-eth01.build.f_cpu=240000000L
wt32-eth01.build.flash_size=4MB
wt32-eth01.build.flash_freq=40m
wt32-eth01.build.flash_mode=dio
wt32-eth01.build.boot=dio
wt32-eth01.build.partitions=default
wt32-eth01.build.defines=
wt32-eth01.build.extra_libs=

wt32-eth01.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
wt32-eth01.menu.PartitionScheme.default.build.partitions=default
wt32-eth01.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
wt32-eth01.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
wt32-eth01.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
wt32-eth01.menu.PartitionScheme.minimal.build.partitions=minimal
wt32-eth01.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
wt32-eth01.menu.PartitionScheme.no_ota.build.partitions=no_ota
wt32-eth01.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wt32-eth01.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
wt32-eth01.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
wt32-eth01.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
wt32-eth01.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
wt32-eth01.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
wt32-eth01.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
wt32-eth01.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
wt32-eth01.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
wt32-eth01.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
wt32-eth01.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
wt32-eth01.menu.PartitionScheme.huge_app.build.partitions=huge_app
wt32-eth01.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
wt32-eth01.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
wt32-eth01.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wt32-eth01.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

wt32-eth01.menu.FlashMode.qio=QIO
wt32-eth01.menu.FlashMode.qio.build.flash_mode=dio
wt32-eth01.menu.FlashMode.qio.build.boot=qio
wt32-eth01.menu.FlashMode.dio=DIO
wt32-eth01.menu.FlashMode.dio.build.flash_mode=dio
wt32-eth01.menu.FlashMode.dio.build.boot=dio

wt32-eth01.menu.FlashFreq.80=80MHz
wt32-eth01.menu.FlashFreq.80.build.flash_freq=80m
wt32-eth01.menu.FlashFreq.40=40MHz
wt32-eth01.menu.FlashFreq.40.build.flash_freq=40m

wt32-eth01.menu.UploadSpeed.921600=921600
wt32-eth01.menu.UploadSpeed.921600.upload.speed=921600
wt32-eth01.menu.UploadSpeed.115200=115200
wt32-eth01.menu.UploadSpeed.115200.upload.speed=115200
wt32-eth01.menu.UploadSpeed.256000.windows=256000
wt32-eth01.menu.UploadSpeed.256000.upload.speed=256000
wt32-eth01.menu.UploadSpeed.230400.windows.upload.speed=256000
wt32-eth01.menu.UploadSpeed.230400=230400
wt32-eth01.menu.UploadSpeed.230400.upload.speed=230400
wt32-eth01.menu.UploadSpeed.460800.linux=460800
wt32-eth01.menu.UploadSpeed.460800.macosx=460800
wt32-eth01.menu.UploadSpeed.460800.upload.speed=460800
wt32-eth01.menu.UploadSpeed.512000.windows=512000
wt32-eth01.menu.UploadSpeed.512000.upload.speed=512000

