ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
aw2eth.menu.PartitionScheme.default=Default
aw2eth.menu.PartitionScheme.default.build.partitions=default
aw2eth.menu.PartitionScheme.no_ota=No OTA (Large APP)
aw2eth.menu.PartitionScheme.no_ota.build.partitions=no_ota
aw2eth.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
aw2eth.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
aw2eth.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
aw2eth.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

aw2eth.menu.UploadSpeed.921600=921600
aw2eth.menu.UploadSpeed.921600.upload.speed=921600
aw2eth.menu.UploadSpeed.115200=115200
aw2eth.menu.UploadSpeed.115200.upload.speed=115200
aw2eth.menu.UploadSpeed.256000.windows=256000
aw2eth.menu.UploadSpeed.256000.upload.speed=256000
aw2eth.menu.UploadSpeed.230400.windows.upload.speed=256000
aw2eth.menu.UploadSpeed.230400=230400
aw2eth.menu.UploadSpeed.230400.upload.speed=230400
aw2eth.menu.UploadSpeed.460800.linux=460800
aw2eth.menu.UploadSpeed.460800.macosx=460800
aw2eth.menu.UploadSpeed.460800.upload.speed=460800
aw2eth.menu.UploadSpeed.512000.windows=512000
aw2eth.menu.UploadSpeed.512000.upload.speed=512000

aw2eth.menu.DebugLevel.none=None
aw2eth.menu.DebugLevel.none.build.code_debug=0
aw2eth.menu.DebugLevel.error=Error
aw2eth.menu.DebugLevel.error.build.code_debug=1
aw2eth.menu.DebugLevel.warn=Warn
aw2eth.menu.DebugLevel.warn.build.code_debug=2
aw2eth.menu.DebugLevel.info=Info
aw2eth.menu.DebugLevel.info.build.code_debug=3
aw2eth.menu.DebugLevel.debug=Debug
aw2eth.menu.DebugLevel.debug.build.code_debug=4
aw2eth.menu.DebugLevel.verbose=Verbose
aw2eth.menu.DebugLevel.verbose.build.code_debug=5

aw2eth.menu.EraseFlash.none=Disabled
aw2eth.menu.EraseFlash.none.upload.erase_cmd=
aw2eth.menu.EraseFlash.all=Enabled
aw2eth.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

Bee_Data_Logger.name=Bee Data Logger
Bee_Data_Logger.vid.0=0x303a
Bee_Data_Logger.pid.0=815C

Bee_Data_Logger.bootloader.tool=esptool_py
Bee_Data_Logger.bootloader.tool.default=esptool_py

Bee_Data_Logger.upload.tool=esptool_py
Bee_Data_Logger.upload.tool.default=esptool_py
Bee_Data_Logger.upload.tool.network=esp_ota

Bee_Data_Logger.upload.maximum_size=1310720
Bee_Data_Logger.upload.maximum_data_size=327680
Bee_Data_Logger.upload.flags=
Bee_Data_Logger.upload.extra_flags=
Bee_Data_Logger.upload.use_1200bps_touch=true
Bee_Data_Logger.upload.wait_for_upload_port=true
Bee_Data_Logger.upload.speed=921600

Bee_Data_Logger.serial.disableDTR=false
Bee_Data_Logger.serial.disableRTS=false

Bee_Data_Logger.build.tarch=xtensa
Bee_Data_Logger.build.bootloader_addr=0x0
Bee_Data_Logger.build.target=esp32s3
Bee_Data_Logger.build.mcu=esp32s3
Bee_Data_Logger.build.core=esp32
Bee_Data_Logger.build.variant=Bee_Data_Logger
Bee_Data_Logger.build.board=BEE_DATA_LOGGER

Bee_Data_Logger.build.cdc_on_boot=1
Bee_Data_Logger.build.msc_on_boot=1
Bee_Data_Logger.build.dfu_on_boot=1
Bee_Data_Logger.build.f_cpu=240000000L
Bee_Data_Logger.build.flash_size=8MB
Bee_Data_Logger.build.flash_freq=80m
Bee_Data_Logger.build.flash_mode=dio
Bee_Data_Logger.build.partitions=default_8MB
Bee_Data_Logger.build.defines=
Bee_Data_Logger.build.loop_core=-DARDUINO_RUNNING_CORE=1
Bee_Data_Logger.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
Bee_Data_Logger.build.boot=qio
Bee_Data_Logger.build.partitions=default
Bee_Data_Logger.build.defines=

Bee_Data_Logger.menu.CDCOnBoot.default=Enabled
Bee_Data_Logger.menu.CDCOnBoot.default.build.cdc_on_boot=1
Bee_Data_Logger.menu.CDCOnBoot.dis_cdc=Disabled
Bee_Data_Logger.menu.CDCOnBoot.dis_cdc.build.cdc_on_boot=0

Bee_Data_Logger.menu.MSCOnBoot.default=Disabled
Bee_Data_Logger.menu.MSCOnBoot.default.build.msc_on_boot=0
Bee_Data_Logger.menu.MSCOnBoot.msc=Enabled
Bee_Data_Logger.menu.MSCOnBoot.msc.build.msc_on_boot=1

Bee_Data_Logger.menu.DFUOnBoot.default=Disabled
Bee_Data_Logger.menu.DFUOnBoot.default.build.dfu_on_boot=0
Bee_Data_Logger.menu.DFUOnBoot.dfu=Enabled
Bee_Data_Logger.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

Bee_Data_Logger.menu.USBMode.default=USB-OTG
Bee_Data_Logger.menu.USBMode.default.build.usb_mode=0
Bee_Data_Logger.menu.USBMode.default.upload.use_1200bps_touch=true
Bee_Data_Logger.menu.USBMode.default.upload.wait_for_upload_port=true
Bee_Data_Logger.menu.USBMode.hwcdc=Hardware CDC and JTAG
Bee_Data_Logger.menu.USBMode.hwcdc.build.usb_mode=1
Bee_Data_Logger.menu.USBMode.hwcdc.upload.use_1200bps_touch=false
Bee_Data_Logger.menu.USBMode.hwcdc.upload.wait_for_upload_port=false

Bee_Data_Logger.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Bee_Data_Logger.menu.PartitionScheme.default.build.partitions=default
Bee_Data_Logger.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Bee_Data_Logger.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Bee_Data_Logger.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Bee_Data_Logger.menu.PartitionScheme.no_ota.build.partitions=no_ota
Bee_Data_Logger.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Bee_Data_Logger.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Bee_Data_Logger.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Bee_Data_Logger.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Bee_Data_Logger.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Bee_Data_Logger.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Bee_Data_Logger.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Bee_Data_Logger.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Bee_Data_Logger.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Bee_Data_Logger.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Bee_Data_Logger.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Bee_Data_Logger.menu.PartitionScheme.huge_app.build.partitions=huge_app
Bee_Data_Logger.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

Bee_Data_Logger.menu.DebugLevel.none=None
Bee_Data_Logger.menu.DebugLevel.none.build.code_debug=0
Bee_Data_Logger.menu.DebugLevel.error=Error
Bee_Data_Logger.menu.DebugLevel.error.build.code_debug=1
Bee_Data_Logger.menu.DebugLevel.warn=Warn
Bee_Data_Logger.menu.DebugLevel.warn.build.code_debug=2
Bee_Data_Logger.menu.DebugLevel.info=Info
Bee_Data_Logger.menu.DebugLevel.info.build.code_debug=3
Bee_Data_Logger.menu.DebugLevel.debug=Debug
Bee_Data_Logger.menu.DebugLevel.debug.build.code_debug=4
Bee_Data_Logger.menu.DebugLevel.verbose=Verbose
Bee_Data_Logger.menu.DebugLevel.verbose.build.code_debug=5

Bee_Data_Logger.menu.EraseFlash.none=Disabled
Bee_Data_Logger.menu.EraseFlash.none.upload.erase_cmd=
Bee_Data_Logger.menu.EraseFlash.all=Enabled
Bee_Data_Logger.menu.EraseFlash.all.upload.erase_cmd=-e

############################################################

Bee_Motion_S3.name=Bee Motion S3
Bee_Motion_S3.vid.0=0x303a
Bee_Motion_S3.pid.0=0x8113

Bee_Motion_S3.bootloader.tool=esptool_py
Bee_Motion_S3.bootloader.tool.default=esptool_py

Bee_Motion_S3.upload.tool=esptool_py
Bee_Motion_S3.upload.tool.default=esptool_py
Bee_Motion_S3.upload.tool.network=esp_ota

Bee_Motion_S3.upload.maximum_size=1310720
Bee_Motion_S3.upload.maximum_data_size=327680
Bee_Motion_S3.upload.flags=
Bee_Motion_S3.upload.extra_flags=
Bee_Motion_S3.upload.use_1200bps_touch=true
Bee_Motion_S3.upload.wait_for_upload_port=true
Bee_Motion_S3.upload.speed=921600

Bee_Motion_S3.serial.disableDTR=false
Bee_Motion_S3.serial.disableRTS=false

Bee_Motion_S3.build.tarch=xtensa
Bee_Motion_S3.build.bootloader_addr=0x0
Bee_Motion_S3.build.target=esp32s3
Bee_Motion_S3.build.mcu=esp32s3
Bee_Motion_S3.build.core=esp32
Bee_Motion_S3.build.variant=Bee_Motion_S3
Bee_Motion_S3.build.board=BeeMotionS3

Bee_Motion_S3.build.cdc_on_boot=1
Bee_Motion_S3.build.msc_on_boot=1
Bee_Motion_S3.build.dfu_on_boot=1
Bee_Motion_S3.build.f_cpu=240000000L
Bee_Motion_S3.build.flash_size=8MB
Bee_Motion_S3.build.flash_freq=80m
Bee_Motion_S3.build.flash_mode=dio
Bee_Motion_S3.build.partitions=default_8MB
Bee_Motion_S3.build.defines=
Bee_Motion_S3.build.loop_core=-DARDUINO_RUNNING_CORE=1
Bee_Motion_S3.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
Bee_Motion_S3.build.boot=qio
Bee_Motion_S3.build.partitions=default
Bee_Motion_S3.build.defines=

Bee_Motion_S3.menu.CDCOnBoot.default=Enabled
Bee_Motion_S3.menu.CDCOnBoot.default.build.cdc_on_boot=1
Bee_Motion_S3.menu.CDCOnBoot.dis_cdc=Disabled
Bee_Motion_S3.menu.CDCOnBoot.dis_cdc.build.cdc_on_boot=0

Bee_Motion_S3.menu.MSCOnBoot.default=Disabled
Bee_Motion_S3.menu.MSCOnBoot.default.build.msc_on_boot=0
Bee_Motion_S3.menu.MSCOnBoot.msc=Enabled
Bee_Motion_S3.menu.MSCOnBoot.msc.build.msc_on_boot=1

