ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
##############################################################

unphone7.name=unPhone 7

unphone7.bootloader.tool=esptool_py
unphone7.bootloader.tool.default=esptool_py

unphone7.upload.tool=esptool_py
unphone7.upload.tool.default=esptool_py
unphone7.upload.tool.network=esp_ota

unphone7.upload.maximum_size=1310720
unphone7.upload.maximum_data_size=327680
unphone7.upload.flags=
unphone7.upload.extra_flags=

unphone7.serial.disableDTR=true
unphone7.serial.disableRTS=true

unphone7.build.tarch=xtensa
unphone7.build.bootloader_addr=0x1000
unphone7.build.target=esp32
unphone7.build.mcu=esp32
unphone7.build.core=esp32
unphone7.build.variant=feather_esp32
unphone7.build.board=FEATHER_ESP32

unphone7.build.f_cpu=240000000L
unphone7.build.flash_mode=dio
unphone7.build.flash_size=4MB
unphone7.build.boot=dio
unphone7.build.partitions=default
unphone7.build.defines=-DUNPHONE_SPIN=7

unphone7.menu.FlashFreq.80=80MHz
unphone7.menu.FlashFreq.80.build.flash_freq=80m
unphone7.menu.FlashFreq.40=40MHz
unphone7.menu.FlashFreq.40.build.flash_freq=40m

unphone7.menu.UploadSpeed.921600=921600
unphone7.menu.UploadSpeed.921600.upload.speed=921600
unphone7.menu.UploadSpeed.115200=115200
unphone7.menu.UploadSpeed.115200.upload.speed=115200
unphone7.menu.UploadSpeed.256000.windows=256000
unphone7.menu.UploadSpeed.256000.upload.speed=256000
unphone7.menu.UploadSpeed.230400.windows.upload.speed=256000
unphone7.menu.UploadSpeed.230400=230400
unphone7.menu.UploadSpeed.230400.upload.speed=230400
unphone7.menu.UploadSpeed.460800.linux=460800
unphone7.menu.UploadSpeed.460800.macosx=460800
unphone7.menu.UploadSpeed.460800.upload.speed=460800
unphone7.menu.UploadSpeed.512000.windows=512000
unphone7.menu.UploadSpeed.512000.upload.speed=512000

unphone7.menu.DebugLevel.none=None
unphone7.menu.DebugLevel.none.build.code_debug=0
unphone7.menu.DebugLevel.error=Error
unphone7.menu.DebugLevel.error.build.code_debug=1
unphone7.menu.DebugLevel.warn=Warn
unphone7.menu.DebugLevel.warn.build.code_debug=2
unphone7.menu.DebugLevel.info=Info
unphone7.menu.DebugLevel.info.build.code_debug=3
unphone7.menu.DebugLevel.debug=Debug
unphone7.menu.DebugLevel.debug.build.code_debug=4
unphone7.menu.DebugLevel.verbose=Verbose
unphone7.menu.DebugLevel.verbose.build.code_debug=5

unphone7.menu.PartitionScheme.default=Default
unphone7.menu.PartitionScheme.default.build.partitions=default
unphone7.menu.PartitionScheme.no_ota=No OTA (Large APP)
unphone7.menu.PartitionScheme.no_ota.build.partitions=no_ota
unphone7.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
unphone7.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
unphone7.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
unphone7.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

unphone7.menu.EraseFlash.none=Disabled
unphone7.menu.EraseFlash.none.upload.erase_cmd=
unphone7.menu.EraseFlash.all=Enabled
unphone7.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

unphone8.name=unPhone 8
unphone8.vid.0=0x16D0
unphone8.pid.0=0x1178

unphone8.bootloader.tool=esptool_py
unphone8.bootloader.tool.default=esptool_py

unphone8.upload.tool=esptool_py
unphone8.upload.tool.default=esptool_py
unphone8.upload.tool.network=esp_ota

unphone8.upload.maximum_size=8323072
unphone8.upload.maximum_data_size=2424832
unphone8.upload.flags=
unphone8.upload.extra_flags=
unphone8.upload.use_1200bps_touch=false
unphone8.upload.wait_for_upload_port=false

unphone8.serial.disableDTR=false
unphone8.serial.disableRTS=false

unphone8.build.tarch=xtensa
unphone8.build.bootloader_addr=0x0
unphone8.build.target=esp32s3
unphone8.build.mcu=esp32s3
unphone8.build.core=esp32
unphone8.build.variant=unphone8
unphone8.build.board=unphone8

unphone8.build.usb_mode=1
unphone8.build.cdc_on_boot=0
unphone8.build.msc_on_boot=0
unphone8.build.dfu_on_boot=0
unphone8.build.f_cpu=240000000L
unphone8.build.flash_size=8MB
unphone8.build.flash_freq=80m
unphone8.build.flash_mode=dio
unphone8.build.boot=qio
unphone8.build.boot_freq=80m
unphone8.build.partitions=default_8MB
unphone8.build.defines=-DBOARD_HAS_PSRAM -DUNPHONE_SPIN=8
unphone8.build.loop_core=-DARDUINO_RUNNING_CORE=1
unphone8.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
unphone8.build.flash_type=qspi
unphone8.build.psram_type=qspi
unphone8.build.memory_type={build.flash_type}_{build.psram_type}

unphone8.menu.USBMode.default=Hardware CDC and JTAG
unphone8.menu.USBMode.default.build.usb_mode=1
unphone8.menu.USBMode.hwcdc=USB-OTG (TinyUSB)
unphone8.menu.USBMode.hwcdc.build.usb_mode=0

unphone8.menu.CDCOnBoot.default=Disabled
unphone8.menu.CDCOnBoot.default.build.cdc_on_boot=0
unphone8.menu.CDCOnBoot.cdc=Enabled
unphone8.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

unphone8.menu.MSCOnBoot.default=Disabled
unphone8.menu.MSCOnBoot.default.build.msc_on_boot=0
unphone8.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
unphone8.menu.MSCOnBoot.msc.build.msc_on_boot=1

unphone8.menu.DFUOnBoot.default=Disabled
unphone8.menu.DFUOnBoot.default.build.dfu_on_boot=0
unphone8.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
unphone8.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

unphone8.menu.UploadMode.default=UART0 / Hardware CDC
unphone8.menu.UploadMode.default.upload.use_1200bps_touch=false
unphone8.menu.UploadMode.default.upload.wait_for_upload_port=false
unphone8.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
unphone8.menu.UploadMode.cdc.upload.use_1200bps_touch=true
unphone8.menu.UploadMode.cdc.upload.wait_for_upload_port=true

unphone8.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
unphone8.menu.PartitionScheme.default.build.partitions=default
unphone8.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
unphone8.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
unphone8.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
unphone8.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
unphone8.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
unphone8.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
unphone8.menu.PartitionScheme.minimal.build.partitions=minimal
unphone8.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
unphone8.menu.PartitionScheme.no_ota.build.partitions=no_ota
unphone8.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
unphone8.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
unphone8.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
unphone8.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
unphone8.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
unphone8.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
unphone8.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
unphone8.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
unphone8.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
unphone8.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
unphone8.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
unphone8.menu.PartitionScheme.huge_app.build.partitions=huge_app
unphone8.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
unphone8.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
unphone8.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
unphone8.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
unphone8.menu.PartitionScheme.rainmaker=RainMaker
unphone8.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
unphone8.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728
unphone8.menu.PartitionScheme.max_app_8MB=Maximum APP (7.9MB APP No OTA/No FS)
unphone8.menu.PartitionScheme.max_app_8MB.build.partitions=max_app_8MB

unphone8.menu.CPUFreq.240=240MHz (WiFi)
unphone8.menu.CPUFreq.240.build.f_cpu=240000000L
unphone8.menu.CPUFreq.160=160MHz (WiFi)
unphone8.menu.CPUFreq.160.build.f_cpu=160000000L
unphone8.menu.CPUFreq.80=80MHz (WiFi)
unphone8.menu.CPUFreq.80.build.f_cpu=80000000L
unphone8.menu.CPUFreq.40=40MHz
unphone8.menu.CPUFreq.40.build.f_cpu=40000000L
unphone8.menu.CPUFreq.20=20MHz
unphone8.menu.CPUFreq.20.build.f_cpu=20000000L
unphone8.menu.CPUFreq.10=10MHz
unphone8.menu.CPUFreq.10.build.f_cpu=10000000L

