ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
##############################################################

esp32c3m1IKit.name=ESP-C3-M1-I-Kit

esp32c3m1IKit.bootloader.tool=esptool_py
esp32c3m1IKit.bootloader.tool.default=esptool_py

esp32c3m1IKit.upload.tool=esptool_py
esp32c3m1IKit.upload.tool.default=esptool_py
esp32c3m1IKit.upload.tool.network=esp_ota

esp32c3m1IKit.upload.maximum_size=1310720
esp32c3m1IKit.upload.maximum_data_size=327680
esp32c3m1IKit.upload.flags=
esp32c3m1IKit.upload.extra_flags=
esp32c3m1IKit.upload.use_1200bps_touch=false
esp32c3m1IKit.upload.wait_for_upload_port=false

esp32c3m1IKit.serial.disableDTR=false
esp32c3m1IKit.serial.disableRTS=false

esp32c3m1IKit.build.tarch=riscv32
esp32c3m1IKit.build.target=esp
esp32c3m1IKit.build.mcu=esp32c3
esp32c3m1IKit.build.core=esp32
esp32c3m1IKit.build.variant=esp_c3_m1_i_kit
esp32c3m1IKit.build.board=ESP32C3_M1_I_KIT
esp32c3m1IKit.build.bootloader_addr=0x0

esp32c3m1IKit.build.cdc_on_boot=0
esp32c3m1IKit.build.f_cpu=160000000L
esp32c3m1IKit.build.flash_size=4MB
esp32c3m1IKit.build.flash_freq=80m
esp32c3m1IKit.build.flash_mode=qio
esp32c3m1IKit.build.boot=qio
esp32c3m1IKit.build.partitions=default
esp32c3m1IKit.build.defines=

esp32c3m1IKit.menu.CDCOnBoot.default=Disabled
esp32c3m1IKit.menu.CDCOnBoot.default.build.cdc_on_boot=0
esp32c3m1IKit.menu.CDCOnBoot.cdc=Enabled
esp32c3m1IKit.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

esp32c3m1IKit.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32c3m1IKit.menu.PartitionScheme.default.build.partitions=default
esp32c3m1IKit.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32c3m1IKit.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32c3m1IKit.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32c3m1IKit.menu.PartitionScheme.minimal.build.partitions=minimal
esp32c3m1IKit.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32c3m1IKit.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32c3m1IKit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32c3m1IKit.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32c3m1IKit.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32c3m1IKit.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32c3m1IKit.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32c3m1IKit.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32c3m1IKit.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32c3m1IKit.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32c3m1IKit.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32c3m1IKit.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32c3m1IKit.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32c3m1IKit.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32c3m1IKit.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32c3m1IKit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32c3m1IKit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32c3m1IKit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32c3m1IKit.menu.PartitionScheme.rainmaker=RainMaker
esp32c3m1IKit.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32c3m1IKit.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

esp32c3m1IKit.menu.CPUFreq.160=160MHz (WiFi)
esp32c3m1IKit.menu.CPUFreq.160.build.f_cpu=160000000L
esp32c3m1IKit.menu.CPUFreq.80=80MHz (WiFi)
esp32c3m1IKit.menu.CPUFreq.80.build.f_cpu=80000000L
esp32c3m1IKit.menu.CPUFreq.40=40MHz
esp32c3m1IKit.menu.CPUFreq.40.build.f_cpu=40000000L
esp32c3m1IKit.menu.CPUFreq.20=20MHz
esp32c3m1IKit.menu.CPUFreq.20.build.f_cpu=20000000L
esp32c3m1IKit.menu.CPUFreq.10=10MHz
esp32c3m1IKit.menu.CPUFreq.10.build.f_cpu=10000000L

esp32c3m1IKit.menu.UploadSpeed.921600=921600
esp32c3m1IKit.menu.UploadSpeed.921600.upload.speed=921600
esp32c3m1IKit.menu.UploadSpeed.115200=115200
esp32c3m1IKit.menu.UploadSpeed.115200.upload.speed=115200
esp32c3m1IKit.menu.UploadSpeed.256000.windows=256000
esp32c3m1IKit.menu.UploadSpeed.256000.upload.speed=256000
esp32c3m1IKit.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32c3m1IKit.menu.UploadSpeed.230400=230400
esp32c3m1IKit.menu.UploadSpeed.230400.upload.speed=230400
esp32c3m1IKit.menu.UploadSpeed.460800.linux=460800
esp32c3m1IKit.menu.UploadSpeed.460800.macosx=460800
esp32c3m1IKit.menu.UploadSpeed.460800.upload.speed=460800
esp32c3m1IKit.menu.UploadSpeed.512000.windows=512000
esp32c3m1IKit.menu.UploadSpeed.512000.upload.speed=512000

esp32c3m1IKit.menu.DebugLevel.none=None
esp32c3m1IKit.menu.DebugLevel.none.build.code_debug=0
esp32c3m1IKit.menu.DebugLevel.error=Error
esp32c3m1IKit.menu.DebugLevel.error.build.code_debug=1
esp32c3m1IKit.menu.DebugLevel.warn=Warn
esp32c3m1IKit.menu.DebugLevel.warn.build.code_debug=2
esp32c3m1IKit.menu.DebugLevel.info=Info
esp32c3m1IKit.menu.DebugLevel.info.build.code_debug=3
esp32c3m1IKit.menu.DebugLevel.debug=Debug
esp32c3m1IKit.menu.DebugLevel.debug.build.code_debug=4
esp32c3m1IKit.menu.DebugLevel.verbose=Verbose
esp32c3m1IKit.menu.DebugLevel.verbose.build.code_debug=5

esp32c3m1IKit.menu.EraseFlash.none=Disabled
esp32c3m1IKit.menu.EraseFlash.none.upload.erase_cmd=
esp32c3m1IKit.menu.EraseFlash.all=Enabled
esp32c3m1IKit.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

roboheart_hercules.name=RoboHeart Hercules

roboheart_hercules.upload.tool=esptool_py
roboheart_hercules.upload.tool.default=esptool_py
roboheart_hercules.upload.maximum_size=1310720
roboheart_hercules.upload.maximum_data_size=327680
roboheart_hercules.upload.wait_for_upload_port=true
roboheart_hercules.upload.flags=
roboheart_hercules.upload.extra_flags=

roboheart_hercules.serial.disableDTR=true
roboheart_hercules.serial.disableRTS=true

roboheart_hercules.build.tarch=xtensa
roboheart_hercules.build.bootloader_addr=0x1000
roboheart_hercules.build.target=esp32
roboheart_hercules.build.mcu=esp32
roboheart_hercules.build.core=esp32
roboheart_hercules.build.variant=roboheart_hercules
roboheart_hercules.build.board=roboheart_hercules

roboheart_hercules.build.f_cpu=240000000L
roboheart_hercules.build.flash_size=4MB
roboheart_hercules.build.flash_freq=40m
roboheart_hercules.build.flash_mode=dio
roboheart_hercules.build.boot=dio
roboheart_hercules.build.partitions=default
roboheart_hercules.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
roboheart_hercules.build.extra_libs=

