ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
Edgebox-ESP-100.menu.FlashSize.4M=4MB (32Mb)
Edgebox-ESP-100.menu.FlashSize.4M.build.flash_size=4MB
Edgebox-ESP-100.menu.FlashSize.8M=8MB (64Mb)
Edgebox-ESP-100.menu.FlashSize.8M.build.flash_size=8MB
Edgebox-ESP-100.menu.FlashSize.8M.build.partitions=default_8MB
Edgebox-ESP-100.menu.FlashSize.16M=16MB (128Mb)
Edgebox-ESP-100.menu.FlashSize.16M.build.flash_size=16MB
#Edgebox-ESP-100.menu.FlashSize.32M=32MB (256Mb)
#Edgebox-ESP-100.menu.FlashSize.32M.build.flash_size=32MB

Edgebox-ESP-100.menu.LoopCore.1=Core 1
Edgebox-ESP-100.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
Edgebox-ESP-100.menu.LoopCore.0=Core 0
Edgebox-ESP-100.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

Edgebox-ESP-100.menu.EventsCore.1=Core 1
Edgebox-ESP-100.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
Edgebox-ESP-100.menu.EventsCore.0=Core 0
Edgebox-ESP-100.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

Edgebox-ESP-100.menu.USBMode.default=Hardware CDC and JTAG
Edgebox-ESP-100.menu.USBMode.default.build.usb_mode=1
Edgebox-ESP-100.menu.USBMode.hwcdc=USB-OTG (TinyUSB)
Edgebox-ESP-100.menu.USBMode.hwcdc.build.usb_mode=0

Edgebox-ESP-100.menu.CDCOnBoot.default=Disabled
Edgebox-ESP-100.menu.CDCOnBoot.default.build.cdc_on_boot=0
Edgebox-ESP-100.menu.CDCOnBoot.cdc=Enabled
Edgebox-ESP-100.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

Edgebox-ESP-100.menu.MSCOnBoot.default=Disabled
Edgebox-ESP-100.menu.MSCOnBoot.default.build.msc_on_boot=0
Edgebox-ESP-100.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
Edgebox-ESP-100.menu.MSCOnBoot.msc.build.msc_on_boot=1

Edgebox-ESP-100.menu.DFUOnBoot.default=Disabled
Edgebox-ESP-100.menu.DFUOnBoot.default.build.dfu_on_boot=0
Edgebox-ESP-100.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
Edgebox-ESP-100.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

Edgebox-ESP-100.menu.UploadMode.default=UART0 / Hardware CDC
Edgebox-ESP-100.menu.UploadMode.default.upload.use_1200bps_touch=false
Edgebox-ESP-100.menu.UploadMode.default.upload.wait_for_upload_port=false
Edgebox-ESP-100.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
Edgebox-ESP-100.menu.UploadMode.cdc.upload.use_1200bps_touch=true
Edgebox-ESP-100.menu.UploadMode.cdc.upload.wait_for_upload_port=true

Edgebox-ESP-100.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Edgebox-ESP-100.menu.PartitionScheme.default.build.partitions=default
Edgebox-ESP-100.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Edgebox-ESP-100.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Edgebox-ESP-100.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Edgebox-ESP-100.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Edgebox-ESP-100.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
Edgebox-ESP-100.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Edgebox-ESP-100.menu.PartitionScheme.minimal.build.partitions=minimal
Edgebox-ESP-100.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Edgebox-ESP-100.menu.PartitionScheme.no_ota.build.partitions=no_ota
Edgebox-ESP-100.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Edgebox-ESP-100.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Edgebox-ESP-100.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Edgebox-ESP-100.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Edgebox-ESP-100.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Edgebox-ESP-100.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Edgebox-ESP-100.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Edgebox-ESP-100.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Edgebox-ESP-100.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Edgebox-ESP-100.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Edgebox-ESP-100.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Edgebox-ESP-100.menu.PartitionScheme.huge_app.build.partitions=huge_app
Edgebox-ESP-100.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Edgebox-ESP-100.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Edgebox-ESP-100.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Edgebox-ESP-100.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Edgebox-ESP-100.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Edgebox-ESP-100.menu.PartitionScheme.fatflash.build.partitions=ffat
Edgebox-ESP-100.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
Edgebox-ESP-100.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
Edgebox-ESP-100.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
Edgebox-ESP-100.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
Edgebox-ESP-100.menu.PartitionScheme.rainmaker=RainMaker
Edgebox-ESP-100.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
Edgebox-ESP-100.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

Edgebox-ESP-100.menu.CPUFreq.240=240MHz (WiFi)
Edgebox-ESP-100.menu.CPUFreq.240.build.f_cpu=240000000L
Edgebox-ESP-100.menu.CPUFreq.160=160MHz (WiFi)
Edgebox-ESP-100.menu.CPUFreq.160.build.f_cpu=160000000L
Edgebox-ESP-100.menu.CPUFreq.80=80MHz (WiFi)
Edgebox-ESP-100.menu.CPUFreq.80.build.f_cpu=80000000L
Edgebox-ESP-100.menu.CPUFreq.40=40MHz
Edgebox-ESP-100.menu.CPUFreq.40.build.f_cpu=40000000L
Edgebox-ESP-100.menu.CPUFreq.20=20MHz
Edgebox-ESP-100.menu.CPUFreq.20.build.f_cpu=20000000L
Edgebox-ESP-100.menu.CPUFreq.10=10MHz
Edgebox-ESP-100.menu.CPUFreq.10.build.f_cpu=10000000L

Edgebox-ESP-100.menu.UploadSpeed.921600=921600
Edgebox-ESP-100.menu.UploadSpeed.921600.upload.speed=921600
Edgebox-ESP-100.menu.UploadSpeed.115200=115200
Edgebox-ESP-100.menu.UploadSpeed.115200.upload.speed=115200
Edgebox-ESP-100.menu.UploadSpeed.256000.windows=256000
Edgebox-ESP-100.menu.UploadSpeed.256000.upload.speed=256000
Edgebox-ESP-100.menu.UploadSpeed.230400.windows.upload.speed=256000
Edgebox-ESP-100.menu.UploadSpeed.230400=230400
Edgebox-ESP-100.menu.UploadSpeed.230400.upload.speed=230400
Edgebox-ESP-100.menu.UploadSpeed.460800.linux=460800
Edgebox-ESP-100.menu.UploadSpeed.460800.macosx=460800
Edgebox-ESP-100.menu.UploadSpeed.460800.upload.speed=460800
Edgebox-ESP-100.menu.UploadSpeed.512000.windows=512000
Edgebox-ESP-100.menu.UploadSpeed.512000.upload.speed=512000

Edgebox-ESP-100.menu.DebugLevel.none=None
Edgebox-ESP-100.menu.DebugLevel.none.build.code_debug=0
Edgebox-ESP-100.menu.DebugLevel.error=Error
Edgebox-ESP-100.menu.DebugLevel.error.build.code_debug=1
Edgebox-ESP-100.menu.DebugLevel.warn=Warn
Edgebox-ESP-100.menu.DebugLevel.warn.build.code_debug=2
Edgebox-ESP-100.menu.DebugLevel.info=Info
Edgebox-ESP-100.menu.DebugLevel.info.build.code_debug=3
Edgebox-ESP-100.menu.DebugLevel.debug=Debug
Edgebox-ESP-100.menu.DebugLevel.debug.build.code_debug=4
Edgebox-ESP-100.menu.DebugLevel.verbose=Verbose
Edgebox-ESP-100.menu.DebugLevel.verbose.build.code_debug=5

Edgebox-ESP-100.menu.EraseFlash.none=Disabled
Edgebox-ESP-100.menu.EraseFlash.none.upload.erase_cmd=
Edgebox-ESP-100.menu.EraseFlash.all=Enabled
Edgebox-ESP-100.menu.EraseFlash.all.upload.erase_cmd=-e

