ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
nebulas3.menu.UploadSpeed.921600=921600
nebulas3.menu.UploadSpeed.921600.upload.speed=921600
nebulas3.menu.UploadSpeed.115200=115200
nebulas3.menu.UploadSpeed.115200.upload.speed=115200
nebulas3.menu.UploadSpeed.256000.windows=256000
nebulas3.menu.UploadSpeed.256000.upload.speed=256000
nebulas3.menu.UploadSpeed.230400.windows.upload.speed=256000
nebulas3.menu.UploadSpeed.230400=230400
nebulas3.menu.UploadSpeed.230400.upload.speed=230400
nebulas3.menu.UploadSpeed.460800.linux=460800
nebulas3.menu.UploadSpeed.460800.macosx=460800
nebulas3.menu.UploadSpeed.460800.upload.speed=460800
nebulas3.menu.UploadSpeed.512000.windows=512000
nebulas3.menu.UploadSpeed.512000.upload.speed=512000

nebulas3.menu.DebugLevel.none=None
nebulas3.menu.DebugLevel.none.build.code_debug=0
nebulas3.menu.DebugLevel.error=Error
nebulas3.menu.DebugLevel.error.build.code_debug=1
nebulas3.menu.DebugLevel.warn=Warn
nebulas3.menu.DebugLevel.warn.build.code_debug=2
nebulas3.menu.DebugLevel.info=Info
nebulas3.menu.DebugLevel.info.build.code_debug=3
nebulas3.menu.DebugLevel.debug=Debug
nebulas3.menu.DebugLevel.debug.build.code_debug=4
nebulas3.menu.DebugLevel.verbose=Verbose
nebulas3.menu.DebugLevel.verbose.build.code_debug=5

nebulas3.menu.EraseFlash.none=Disabled
nebulas3.menu.EraseFlash.none.upload.erase_cmd=
nebulas3.menu.EraseFlash.all=Enabled
nebulas3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

nano_nora.name=Arduino Nano ESP32
nano_nora.vid.0=0x2341
nano_nora.pid.0=0x0070
nano_nora.upload_port.0.vid=0x2341
nano_nora.upload_port.0.pid=0x0070

nano_nora.bootloader.tool=esptool_py
nano_nora.bootloader.tool.default=esptool_py

nano_nora.upload.tool=dfu-util
nano_nora.upload.tool.default=dfu-util
nano_nora.upload.tool.network=esp_ota
nano_nora.upload.protocol=serial
nano_nora.upload.maximum_size=3145728
nano_nora.upload.maximum_data_size=327680
nano_nora.upload.use_1200bps_touch=false
nano_nora.upload.wait_for_upload_port=false

nano_nora.serial.disableDTR=false
nano_nora.serial.disableRTS=false

nano_nora.build.tarch=xtensa
nano_nora.build.bootloader_addr=0x0
nano_nora.build.target=esp32s3
nano_nora.build.mcu=esp32s3
nano_nora.build.core=esp32
nano_nora.build.variant=arduino_nano_nora
nano_nora.build.board=NANO_ESP32
nano_nora.build.code_debug=0

nano_nora.build.usb_mode=0
nano_nora.build.cdc_on_boot=1
nano_nora.build.msc_on_boot=0
nano_nora.build.dfu_on_boot=1
nano_nora.build.f_cpu=240000000L
nano_nora.build.flash_size=16MB
nano_nora.build.flash_freq=80m
nano_nora.build.flash_mode=dio
nano_nora.build.boot=qio
nano_nora.build.boot_freq=80m
nano_nora.build.partitions=app3M_fat9M_fact512k_16MB
nano_nora.build.defines=-DBOARD_HAS_PIN_REMAP -DBOARD_HAS_PSRAM '-DUSB_MANUFACTURER="Arduino"' '-DUSB_PRODUCT="Nano ESP32"'
nano_nora.build.loop_core=-DARDUINO_RUNNING_CORE=1
nano_nora.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
nano_nora.build.psram_type=opi
nano_nora.build.memory_type={build.boot}_{build.psram_type}

nano_nora.tools.esptool_py.program.pattern_args=--chip {build.mcu} --port "{serial.port}" --before default_reset --after hard_reset write_flash -z --flash_mode {build.flash_mode} --flash_freq {build.flash_freq} --flash_size {build.flash_size} {build.bootloader_addr} "{build.path}/{build.project_name}.bootloader.bin" 0x8000 "{build.path}/{build.project_name}.partitions.bin" 0xe000 "{runtime.platform.path}/tools/partitions/boot_app0.bin" 0xf70000 "{build.variant.path}/extra/nora_recovery/nora_recovery.ino.bin" 0x10000 "{build.path}/{build.project_name}.bin"

##############################################################
